{"The best cafe of Delhi NCR. Period.   AMBIENCE- The place is located by the lanes of Hauz Khas Village, amongst many other cafes as well. The place is pretty much lit up with a quirky environment. Also, the place is very big! This is the place to be in the early evenings.  Back to the Business- FOOD!   Classic Cheese Poutine- These are the basic cheesy and baked fries, seasoned with some Italian herbs. These were fantastic! Fries were crispy and cheesy.   Butter Garlic Chilli Momos- These are the dry, pan-fried momos with enormous flavours of Butter and Garlic. These were hands down THE BEST momos I've ever had!  🔥♥️🔥 Recommended! 🔥  Mixed Sauce Pasta- The pasta was not very high on flavours, was inclined more towards the Arrabiata sauce. Go for it if you're a fan of Mix Sauce Pasta!  💯  SERVICE- The place has servers who're always happy to help you but then the crowd is in large quantity as well. Still, you'll be satisfied and engaged with a great view of the side by lake. 💯": 308322, "": 18241537, "We stumbled upon this place by chance and oh it was soo worth it. Hauz khas social is a place that mesmerizes with its ambience first then food. The lake view was tha best part of the restaurant. Everything here was absolutely impeccable. The service by Mr Pankaj was very good and he was so polite. According to me this was a perfect place for a date without hurting your pockets.": 308322, "Personally I didn’t like this place, too shady and pricy. The food vs price proportion is quite odd.": 308322, "I love the black theme of the cafe. it's a very attractive & Cool  Nice Interior with very good food.  I really enjoy the food here different dishes wid my friends which turned out to be very good for us and we will visit here again for trying more different varieties of food.": 308322, "Its a lovely place , the ambience as well as the staff is good . The food was also good. One can come here to spend some time with their friends": 18037817, "There is a lot more to menu  Zomato's menu is not updated. Wide range of dishes makes it a must go  place  Ambience is  amazing (dark theme ) (5/5) Their Shanghai rolls were really very appealing and the quantity was good too (5/5) Bharwan khumbh were also very flavoury and tasty(4/5) Corn and spinach Dimsums were not very tasty kind of feeka feeka taste (2.5/5) although the quantity was impressive  Recommended ✌️": 18037817, "One of the most happening place, They serve fingerlicking and lips smacking food, I loved the shakes here and also paneer tikka. Beautiful ambience,full party crowd and decent staff. Perfect place for party.": 18037817, "Improve ur product knowledge": 18037817, "The oreo cookie shake of this place is just so amazing. A must have if you are in the area. Coming to food i feel they can add a few more options but the white sauce pasta of this place is really awesome. All in all recommended place!": 312345, "This place is named after the very famous Hudson Lane. The street is foodies paradise. The place is very popular among the students since its close proximity to the University of Delhi. They have a very vast menu, mainly in Italian and Continental dishes. I have ordered Spicy Chicken Tikka Pizza, Chicken Lasagne and made my own Burger. All these are amazing in taste. The ambiance is pleasing and staff is also very helpful in choosing the right dishes from the menu. Do explore this place!": 312345, "Overall food is worthy the place . Just a bit cut in the prices of drinks like mojitos and shakes :)": 312345, "You can visit there with your family too..! Nice Place to have some Good food and Enjoy Time With your Loved ones": 312345, "This place has great rooftop ambiance. The seating is comfortable and music is good. We tried chilli chicken and cheesy fries along with cocktails. Everything was nice. The service is also decent.": 307490, "I went back and forth about my feelings on Summer House. And I would like to say that it is an inclusive club with gaurded dance and bar areas. I felt save in this club where I met a lot of other people (or maybe it was by luck). I have given 2 stars only because the bartender didn't gave us happy hour offer and we ended up paying double the amount, quite a bummer. We ordered 4 heineken while it was still happy hour and 2 others later than that.": 307490, "Tandoori paneer tikka was really good with quality nd quantity. panner cubes made so softly nd delicious. delivery was not delayed which was relief for me. The packing was great nd perfect. Masala were in awsmm flavors.": 18241537, "I visited this place with my friends on my birthday, no doubt their ambience is obviously classic. The food we ordered was delicious and drinks were too good. Overall presentation of the food was great here👍🏻": 18241537, "There live music is just amazing": 18241537, "A nice decor with great food. We ordered chicken lassagna and i will give 4/5 and lemon mojito 5/5. The lassagna was more than sufficient in quantity and the drink was very refreshing.  And cant forget to mention the live music which mesmerized our heart and made our lunch more appeasing🤩": 18241537}