{"They Serve One Of the best desi Chinese nearby. Have a big & tasty menu with alot of variations. One Should Must Try There Chinese. Also You Can Checkout More On Instagram @legendseatit Facebook @legendseatit Legends EatIt": 18198449, "": 18377912, "Most of the reviews seems fake here...  If u look carefully all ppl have mass reviews give 5 star (those are paid food bloggers) and general public give 1-3stars... Food was kind of state and tasteless... Excess amount of oil and spices... Its just cheap food not tasty... Chaanp is all maida and paneer seems adulterated": 18198449, "Butter naan had a hair strand and Paneer was stale. We trust Zomato and place our orders during these times but these type of unhygienic incidents just breaks our trust.": 18198449, "Ah So Yum is one of the best Asian food delivering place of gurgaon. I have been ordering from here since past few months.   Kung pao chicken and Oriental fried rice are really some top picks from here.  One must try these. 👏": 18945610, "I am big fan of oriental food and dimsums and I was surprised to see this outlet Ah So Yum delivering most of my family favorites, we have been regularly ordering Veg chilli oil dimsums, water chestnut dimsums, Thai Curry, Angry Bird Bao, and Poke Bowl. Everything was so good and neatly packaged. I would highly recommend this to people living in Gurgaon.": 18945610, "Hakka noodles with manchurian ordered from Ah So Yum. Hygiene rating is excellent and they check rider temperature. Also their rating is 4.9, once ai was sure about the place I decided to order from them. This was my first food order after 10th March.  Food from here was packed very well. Food was very tasty lots of veggies were added to hakka noodles.  Perfect hygienic food delivery place. 😍😍": 18945610, "Meal Bowl perfect for one person. I live as a Paying guest in Ardee city, gurgaon. I am facing tough time due to corona virus. My maid who cooks food has left for her village. I have been managing with maggi, MTR food and sometimes online ordering. I have ordered around 6-8 times from Ah So Yum and they gave me good discount too. I loved their meal bowl perfect for one person. Burmese Khaosuey, Poke Bowl, Paneer Bowl, manchurian with hakka noodles, etc. I have tried from here. This place has been very nice to me considering my situation and giving me special 35% discount. Thank you very very much ah so yum. I wish you guys great time ahead.": 18945610, "Lovely thai curry with rice and sprite cans made my birthday special. I am at home and in january we booked tickets for Dubai on my birthday but due to Covid-19, I am locked inside my house. I ordered online from Ah So Yum to make my day better.   Food here is really good.  Ah so yum online ordering was only celebration I did on my 24th birthday. 🥳 thanks to them.": 18945610, "Bhature was very hard to tear and chewy. Chole was good and tasty. We’re not able to tear bhature. Surprised by this experience as food quality is usually good.": 496, "I miss you Bikanerwala! This lockdown is making me crave for everything I loved at Bikanerwala: The Chhole Bhatoore, the sweets and the evergreen Delux Thali!   Hope to be there soon!": 496, "Love there food and ambiance. It’s a family friendly restaurant with delicious food. I highly recommend this place. After lockdown ends I’ll definitely go here for dine in. Tables are cleaned after one gets up.": 496, "This place has a huge sitting area. The place has clean and well maintained in terms hygiene. It has everything to satiate your hunger pangs. Do try this place for absolutely delightful experience.": 496, "Personally in love with the place . Love eating every second dish . Their sweets, snacks everything is so up to the mark and most importantly very affordable. A must visit place.": 313106, "I visited om Sweets today to get cake and few other things for my mom's birthday. I was accompanied by my dad.  we collected the cake and samosas from the counter and was about to start our vehicle when a staff came running towards us and asked us to show the bill of the cake. We showed him the bill of the truffle cake but he still took the cake from our hand and asked us to come inside. We were a little embarrassed with no fault of ours. We payed the bill, we collected our cake. I told my dad to wait outside. I went inside with him, and was told ab jao jao. They didn't even apologise until my dad came inside and asked him \"is this the way they treat their customers\". They should ask their guards to check the bill before hand only. We were left embarrassed in front of the people outside and were made to look like thieves who took the cake without paying. Management is the key to success. You won't be spared in the name of big brand.": 313106, "I ordered chole bhature few days back, it always used to b gud whenever I had them by this time they were pathetic..... No salad was provided n bhaturas were thick n also not properly packed.....I especially wrote for green chutney bt it was not provided to me.....first time m disappointed from om": 313106, "Om Sweets serves one of the Best North Indian Food in the city. Their Chinese Thali, Chana Bhatura and Pav Bhaji are awesome in taste. Their sweets and snacks like Dodha Barfi, Dahi Bhalle chat and Golgappe are amazing. The service is also good. Highly recommended ♥️♥️": 313106, "I am very much disappointed with food tasteless and seems like 1 -2 day old dal makhni and kadahi paneer and tandoori rotis like stone and all burnt I threw all food nobody likes at my home...😏😏": 18377912, "I ordered zeera rice but they gave me plastic rice.worst rice I ever ate in my life.": 18377912, "I was satisfied with the taste they are offering at the reasonable prices and the plus point being a pure vegetarian restaurant. There service is pretty good. When i visited them the staff was also well behaved.": 18377912}