{"This Hotel offers variety of malabar cuisines its very tasty and yummy tummy.The service was good and prices are very reasonable.Always gets missing homely food taste.": "18323144", "Biryani from this joint is awesome. Great place to enjoy typical Kerala delicacies.. Taste and higene is what I like most from Malabar catering house.": "18323144", "Awesome food ...great taste moreover a superb southindian malabari taste in biriyani..had a great experience. Wishing them a great future ahead.": "18323144", "Please take orders from Zomato . And please cut down on the minimum delivery charges. This can fetch good lot of orders . Please take this changes into consideration..": "18323144", "Thumps Up and 5 Star to Malabar Catering House, Mayapuri. We had ordered catering service with them for about 50 people for Non-Veg Kerala Cuisine. Each and every dish and curry like Kerala chicken curry, fish fry, sambhar, more curry etc was so tasty as if it was home made. At last we can now say that we have an authentic Kerala Food caterers in West Delhi. Not to mention that the quantity provided was also more than sufficient, which will never leave the hosts in any embarrassing situation. We appreciate the Caring and Big Heart of Mr Mathew of Malabar Catering House.": "18323144", "": "9956", "I've always been a momos lover. And flirty momos is best for momos. I always order momos, but this time i ordered spring roll. They were really very crispy, spicy. Their green chutney was amazing.": "18365385", "This place is in rajouri garden. The ambience is small but quiet well. The decor is very good. They serves very delicious food. It is very pocket friendly. Must visit": "18461723", "This serves excellent food .I have tried here red sauce pasta , grilled sandwich and shakes amazing in taste": "18461723", "tried there red sauce pasta it was so bad the cream was not so good nd staff was very lazy nd aggressive . but shakes r good here": "18461723", "A nice small shop at the corner. Nice sitting as well. And the food was good tho except the mix sauce pasta it was okok.": "18461723", "I seriously don't understand why this restaurant did this to me, I've ordered Chilli Chicken Combo, Fried rice was fine but chilli chicken pcs was smelly too much that i was feeling like the raw rotten chicken was under the outer coating, i didn't understand after making good fried rice and damn good gravy why restuarant used stale chicken, this can harmful for someone's health also 🤮": "8649", "Order didn’t have onion also the order was totally cold as if it was prepared long ago. Though the taste was ok however, it would have been better if it were hot.": "8649", "Great place for students": "8649", "Not upto the expectations": "8649", "The butter chicken was not upto the expections. Also the butter naan was burnt.i believe they can work upon their food quality. Though the delivery was quite speedy": "8649", "it is a good food joint maybe not for dine in as it does have very poor ambience but if u want to enjoy your food at home you can surely order from here Especially butter chicken it fully satisfies your taste buds Recently ordered cream chicken it was ok I expected it to taste much better This restaurant is nothing compared to original Chawla but one can surely try it": "309435", "I have been to lots of restaurants, had lots of cuisines but not yet able to find better cuisine than our Punjabi cuisine. Chawla chicken (Chawla's) started since 1960 now has multiple branches in Delhi NCR. We were attending a event in Rajouri Garden and after getting bored for some time we moved out to have dinner. Opposite to the party place happened to be DDA market of Rajouri Garden which has the all famous Chawla's. It has seating available in indoors as well as outdoors. Indoor seating was full with waiting of around 15-20 mins. We choose to sit outside.  We ordered special Chawla Butter chicken, butter naan and chicken lollipop. Butter chicken was served with lots of butter on top of it. It was already very creamy and buttery and butter on top of it made it lot more heavier. It looked mouth watering. Chicken was soft and juicy.  Chicken lolipop was fried chicken served with chaat masala. It was crisp from outside and soft from inside. It was delectable. It was a good experience at the Chawla's. I will certainly try their other branches.  Cheers :)": "309435", "One of the best places in rajouri garden to have a good time with ur family. Everytime this place is our first choice when we want to eat some mughlai food. All over everything is upto the mark.": "309435", "The mutton Rara is delicious. Must try Afghani chicken. The quantity is less. During a show(HOMP) on ndtv good times the owner in punjab said  that they serve small pieces of chicken because it is juicier. Yaar but people like us need big pieces and don't say that big pieces do not have juice in it. Learn from KFC. Food is good and I have heard that the chefs are from Punjab in Delhi. Cream chicken tastes ok too. Avoid lemon chicken": "309435", "Only decent place to eat with family in air conditioned Restaurant. Chinese food is average but Mughlai is tasty.  Infact this whole corner is famous for Mughlai food only.  I ordered chinese only for kids.  Reasonable price tags. Must visit if ur in Rajouri.": "309435", "A nice ice cream parlour located in the J block DDA market at Rajouri Garden. This place has opened recently and keeps flavours of a known brand in Delhi, Havmor. Overall the place is neatly kept and the work station is ready for action. They prepared shakes and sundaes. Kulfi flavours are also available. The ice cream is good and fresh. Taste wise also it is wonderful. I am not too much of a fan of ice cream but I did enjoy two scoops of metro delight in a cup. They will introduce fresh flavours too. Those I will try again to check out the fun. There is limited seating inside the shop, but you can always wander outside and dig into your icecream. This place is surrounded by lots of restaurants and parking is adequate outside. You may have some problems locating the shop, but check for directions and signboards.": "18255603", "This place is too good...presentation and taste z awesome....quality is very good...and they have lots of varities in icecreams,shakes etc....": "18255603", "One of the best ice cream parlor ever visited, last night i had tried hot chocolate fudge it was amazing and the price was ok for that, must visit at least once.": "18255603", "A cute little ice cream parlour with all options(ice creams, faluda, stick kulfi, sundaes) under one roof...run by a family with love and passion for ice cream making, and the kulfi faluda is made with all time to make it stand out ... The price point is icing on the cake, so you get better quality and toooo good prices... You may forget the Gianis's for sure. We tried the mango, tutti fruity, kulfi faluda and stick kulfi, All 👌👌  The matka kulfi was sold out, heard that is also a hit.   The place is next to Sethis in Rajouri Garden , bang opposite Surya Hotel.  So go and enjoy the summers": "18255603", "One of a unique n fresh ice creams with a twist. Loved this place n pocket friendly also. The variants of base flavours with the creativity gives a mouth watering desire to eat repeat and repeat and repeat": "18255603", "worst dal makhani nd paneer butter masala last nyt srsly never order frm this restaurant again yuck food (ghtiya khana) bekar food late delivery it will be close down soon": "18228874", "I ordered the food at 11:00 pm on friday, was delivered in 35 mins . Food was hot and well packaged.  Loved the Pindey Choley   Taste was good. Would love to order again.": "18228874", "ordered yellow dal, mutton rara , honey chilly potato and naan. food was good quality. service a little slow otherwise good food. ordered online nice experience. used to order from Gurgaon now shifted to Delhi. tried for first time quality was thankfully the same. best night service": "18228874", "Pathetic food.. just wish i read the reviews feel so bad after eating a bit of it. Entire order and night and hunger wasted. Just praying not to fall sick.. bads on delivery  Update number 2: just called these guys and complained that chicked kathi roll is not minced checked liaded with mint cutney and onion.  And the reply I get is that \"sir jab hum chicken piece dalte hain toh cuatomer complaint karta hai ki chicken ke piece chabaye nahi ja rahe\"   Chilli chicken is as hard as a stone because of overcooking, probably recooked more than twice..   At 3:50 am i was offered a re delivery of the food within 15 min from moti nagar to patel nagar.. God knows how it would have been cooked..   Mr. Owner ! Lets do some talking...": "18228874", "Ordered kadhai chicken at 11:30 pm day before yesterday.... got infective diarrhea and got hositalized all d people who ate it....Not at all hygienic": "18228874", "scammer!!!!!!!!!!  they are not sure about their quantity , they dont have option to select for full item , they have plate or half option,  i ordered  murg seek masala plate portion wherein they sent quarter , when i ordered half plate they again quarter , i called the restaurant and informed about this they denied sending the complete order and have charged the full amount , moreover the person on the call was extremely rude and was not at all helpful, beware of this restaurant as they dont deliver complete order.": "308880", "I ordered for mutton curry but i recieved some chicken item and also the food is not fresh and itz not even cooked properly..very bad experience": "308880", "Excellent taste.. Wow... Amazing.. Loved the creamy Bhatti chicken with ginger and green chilli on top.. Keep it up": "308880", "The service is good. But the main thing is the taste which was not quite good. Their Dal Makhni was the worst i tried in moti nagar... 🤨🙈": "310162", "ordered kali mirch chicken and malai chaap.. chicken was made in white pasta sauce which was not good at all.. chaap was ok ... Delivered on tym and also packing was good..": "310162", "Yesterday i ordered noodles and it was pathetic. Very bad service. Need compensation. Kindly improve the quality of food. This was very terrifying": "310162", "Tasteless food . I ordered paneer tikka masala, it was spiceless. There were no spices and salts in the dish and paneer in gravy was also not paneer tikka, it was an ordinary paneer. So, I would recommend to not taste this dish at least": "310162", "Awsome food at reasonable prices..worth a visit..Non vegetarians should definitely give a visit to satisy their hunger for non veg..all over a good experience 😊": "310162", "Every thing here was good but the minifudge had less chocolate syrup and melted ice cream Had better in gianis and other ice cream outlets Fruit sundae was very good full of fruits Service was quick": "305861", "I love this place only for the one ultimate dessert they offer- The Gadbad Sundae. The store boys ask you to select 4 ice-creams of your choice. Then, freshly cut fruits, jellies and nuts are poured over the ice-cream making a sweet and tempting delicacy. It cannot be eaten by a single person alone, hence always share it with a friend!": "305861", "Nutty buddy,hot chocolate fudge, brownie with vanilla and pan kulfi are the best ice cream which everyone should try for their best experience with kings kulfi..": "305861", "Pan kulfi is good here and we generally like visiting this place. Their service is good and the place is neat and clean. Quality of their ice creams is also good,, its a must try place": "305861", "This is one of my go to places whenever I crave for delicious chicken seekh kebab and tawa chicken.  The speciality of this outlet is that it serves masala kulcha along with the main course. I know it sounds weird but it is actually a great combination. Once you'll try it, you'll agree to my point.  The only drawback is that it has outdoor seating area only or you can have it in your car.  So, the ratings --> Taste - 4.5/5 Hygiene - 4/5 Service - 3.5/5 Price - $$ Overall- 4/5 ( a must visit place )": "18382113", "Food is great but price is high and quantity is low": "18382113", "Delhi is famous for chole bhature so as this outlet.went to this place for a lazy breakfast with friends and ordered chole bahture ,palak paneer chawal and sweet lassi.my experience was good. Chole bhature 4.5/5 Palk chawal 3.5/5 Lassi 4/5 Staff was good n quick to serve.i recommend this place for tasty chole bhature.": "312916", "the best part about the place is the midnight delivery...n still one will not be disappointed with the taste of food here ...malai chaap is a must try here": "18249097", "First of all, the ease at time we can order the food. Even at the mid night, we can enjoy the food. Food taste is good. Economical to suite ur pocket. Delivery time is also fine. At least they are providing you food at 12-1am :)": "18249097", "Writing this review at 2am, ordered both veg and non veg, the food was quite warm  freshly done as there was no compromise wether it is late night delivery, delivered in the given time, taste good, well prepared, well packed and budgeted food, highly recommended to late night eaters, will order soon.": "18249097", "My experience with this one is just perfect... Ive ordered almost everything from them uncountable times and every time i get my food fast and finger licking good and not very expensive. Try this place for some awesome snacks. But one day i ordered crispy chicken and tandoori leg. No doubt tandoori leg was awesome but crispy chicken was not at all crispy n was very soggy like some old pakoras. So that is why i am giving it a 4.": "18249097", "How good is the place of man, there are so many variety of cakes available here. Seeing this butterscotch cake, I feel very good and it is very tasty and yummy to eat.": "303589", "Worst services..Worst cake ...Really bad Owner response ..Not even Value for money it is ...Its one of the worst life time cake I ever had. The raindow cake had Only glazed icings ..Taste that one is having dalda ghee in mouth": "303589", "the services and food of snaxpress was very good but the services of zomato was very very poor especially chat services.": "303589", "gud service": "303589", "Its a decent place for all the veggies ,a reasonable place as well not such a dine in place you can order as per your convenience ,A Recommended Place": "313006", "We used to order dal makhini which was delicious but now its tasteless.  Matki Chicken was used to be speciality of this shop but now it's taste is fading  cours.chilly panneer was worst in taste. So don't try anything from this shop": "313006", "I use to order chicken last week from Sanjha chulha but the best of it is Matki chicken ! It's toooo yum ! It contains everything in it from boiled egg to seekh ! The quality and quantity were upto the mark as well.": "313006", "I went to this place and ordered a “Rajma Chawal”. The Rajma Chawal were good. The flavours were balanced. The quantity was pretty good 👍.  I also had “Chole Bhature” which were yummy 😋. The bhatura was big and heavy.": "304586", "Stuffed naan was amazing. Ate yesterday here. It was too good. It is my first choice wheen it comes to having stuffed naan with raita. Must go place.": "304586", "16Mar2019 Tried their aaloo and paneer chur chur naan thali. Naan were well done, shahi paneer, daal and raita was average. Pricing is Rs120 not bad. They do have chole bhature @Rs40. A great steal.": "304586", "Your average roadside channa Bhatura , Amritsari Nan and pakora samosa shop , where price over taste or quality is the key. At ₹35/- a plate these guys sell maybe the cheapest bhaturas you can find at any SHOP ( as opposed to a cart ) in Delhi.  And surprisingly the hygiene standards are actually better than other establishments in this class , but still barely acceptable and the same goes for the taste , acceptable .   Though I am certain no one will plan for a snack here but if you are right there and in the mood for a quick refill and are not too particular about eating , standing on a loud and polluted , big road , you sure can stop for a bite.   ENJOY": "304586", "NAUGHTY 9 KITCHEN & BAR IS A UNIT OF MRIDULA RESTAURANT & BAR IN MOTI NAGAR..Totally having a new look in ambience and as well as new menu. SPECIAL ATTRACTION THE ONLY PLACE HAVING LIVE MUSIC IN THAT AREA &NOW HAPPY HOURS 1+1 ALL TIME ALL DAYS. WATCH IPL ON BIG SCREEN. Having separate space for kitty parties, commities, groups and specially for couples. .Also have separate space for party hall..Great place to hang out. ....": "312213", "Amazing food... very cooperative staff.... Must have:dal makhni,irani tilka chicken rara n lababdar too... a perfect family dining restaurant...": "18471517", "Reasonable price": "18238245", "Zabardast khana hai,but please offers badhao yaar 30 percent off se thoda mehanga padta hai..atleast 40 percent off kardo": "18238245", "Order was placed for 8 .... delivered 7 roti ..and that too cold": "18238245", "Food was good, not examplary, but being on the economical side and tastes just fine, i have no qualms. Just make sure you tell them how you want your food to be (spicy or less spicy etc). I had Butter chicken and Chicken kebab.": "18236975", "Simply best food to taste Spl in butter chicken with butter naan Also try snacks items chicken roll, diet chicken, Malia tikka , tandoori also": "18236975", "Good place for veg or non-veg iteams Special for dal makhni,butter chicken,tandoori chicken,afgani chicken  & matki chicken  Rate was very reasonable": "18236975", "Unhygienic food ,I ordered butter naan dal makhni paneer butter masala rajma chawal(which was very spicy) and the very.next day I am suffering from food poisoning": "9251", "Very tasty food and very nice service. And also pocket friendly.....": "9251", "The quality of their cakes and pastries are unmatchable in Najafgarh! The other items like pastries, fan, burgers and sandwich is great! The best part is the owner of the shop and even staff are super courteous and polite! They customize your order as per your preference.": "311394", "Now they are loosing taste. ordered 10 patties and pastry this is the 4the time for the last 24 days I didn't get any taste . I won't recommend this now Taste DOESN'T MATCHES THE PRICE.": "311394", "adesh bhai kamal hai": "311394", "sonu uncle ka cake kamal hota hai as always": "311394", "worst delivery": "311394", "By product its good here . Paneer momos is very good mix of onion and paneer. Well made and combination of chilli sauce is also good. Must try the momos. Good work chef If the management continually change process for the betterment then for sure this cafe can win many customer .": "313349", "Worst biryani ever": "313349", "I ordered Malai kofta and it was horrible in taste. It was too sweet and not worth spending a penny on it. I do not recommend food from here as quality of food is not good.": "313349", "Mittal is one of some main places in Najafgarh. It's one of some old and famous restaurant here. Since my childhood I saw this place like this and it still stands same. 😏  Food 🍽 is like any other village's sweet corner but better then majority of them. 😐 Mittal Sweet Corner offers Indian snacks, South Indian snacks and Indian sweets as well as Cake 🍰.  The Dine-in area is not so clean as well as the entrance of it.🙄 But it still manageable. 🤔  Paneer Jalebi, Imrati, Chole bhature, Samosa and Dosa are one of it's famous options.🍲  If you live in Najafgarh or nearby there's no way you haven't seen or heard about it. 😅  And if you are new here better visit it once.🤗": "18352288", "Mittal Sweets is one of the oldest shops in Najafgarh and  is known for its quality of sweets and snacks. I have been a regular visitor to the place for the last 15 years and these people are consistent  on their quality.  I have tried their every sweet and snacks. Laddu, gulab jamun, besan ke laddu, motichoor ke laddu, Chole bhature, noodles, dosa, uttapam etc.  This place serves you with quality food. I will rate it 4.": "18352288", "Today I bought burfi,rasgulla n gulab jamun.Rates are fine.rasgulla tastes good.once I eaten here with my friends.things are good..here.\rIts a reasonable price restaurant.": "303500", "I visited this outlet last week..Great disco environment..I tried singapuri noodles..it had a Delicious taste..good to hangout with friends.. Recommend": "18270343", "I visited this outlet last week..It had a nice disco environment..great to hangout with friends": "18270343", "Have been here only once.. seems like a decent place however when I visited, I felt it is not a place to take your family The food was not something worth mentioning as well": "18270343", "It's serves best Chinese Italians Thailand's food and lots of continental dishes in cheap price at your doorstep and quality of food is very good": "18270343", "Not so big outlet in Najafgarh but it is very popular for it's taste. They famous for their desi burfi the traditional taste. Whenever you visit their you found rush there, in the festive season desi burfi was not enough for customers, desi burfi sold out as usual.": "18363067", "A very good shop to buy typical Indian sweets like burfi, gulab jamun. The sweets are really fresh and price is descent for the quality. Their paneer is also very good, but it is only available in the morning.": "18363067", "Too costly and tasteless food not worth that much cost. They don't have knowledge of taste. They have to change their chef for chinese taste.": "9262", "Good Food but low on space.. Metro Work really ruined the business..  The much loved thing is the roasted Chaaps, but have to wait for the winters as they don't cook chaaps in summers...": "9262", "We just had a dinner at this place. At the entrance it looked like a normal dhaba, but once we entered, the ambience was quite good. Idea of village/chaupal look is fabulous. Found chairs a little uncomfortable though.  Food here is awesome, full marks for food and service. The duo owners were friendly...Good going guys..keep it up.  Go for it.": "310357", "Food here is good  , it's a small place run by two folks ,locating this might be a problem but once you enter the ambience it's quit good , quality of good is super fine and costing is every reasonable don't know how it got on zomato , Chinese and south Indian recommend , for the price excellent, and guy on the counter exceptional 4.5 just for him": "310357", "The food here is very delicious......the non veg here is so awsum.....everybody should try atleast once.....the bed is also very delicious.......on top of that they provide delivery as well......that very special..........": "304393", "Delicious food....we had ordered butter chicken and kadhai chicken and butter naan. Price decent and the portions are good too. I also ordered a soya chaap it was nice and i am fan of their soya chap and butter chicken.. Quantity of food was sufficient... Paneer gravy was totally worth full,so amazing food and delivery too... I'm seriously love this place. Will surely come again or order again....": "304393", "One of my fav delivery outlet for non-veg. I have already tried Dodd few times earlier as well end it never disappoint me. Coming to the food the taste of the food is awesome and the quantity add the price is good. liked the butter chicken and that be ordered. Also must try are the various MIB's. There are some good option to try out.authentic taste with right amount of lemongrass to ensure that it's authentic North Indian food😘😘😘😇😇😇😍😍😍😍": "304393", "This place is a paradise and a treat for all North India lovers. They deliver food which is hot and fresh and within prescribed time Amazing taste especially Paneer butter masala. The flavor of Paneer butter masala was delectable and chicken was perfectly marinated. It was delivered in a copper bowl so that the flavor remain intact and the food remains fresh Try this place out and you'll love it": "304393", "I m hardcore fan of North indian food Taste of food Perfect is the word . I have had similar but not better better chicken in my life . Butter chicken was juicy and delightful": "304393", "I am going to this place when I was a small kid n the taste of sweets is just tremendous, outstanding whether u check thr laddu thr mouth watering panner jalebi chamcham n many more but when u talk abt the food this place is totally opposite so thumbs up for thr sweets 👍👍👍👍👍 and a big no for thr food as today eve only I tryed thr onion dosa that was literally pathetic sambhar was literally water n  tasteless coconut chutney was also disappointment n that onion dosa was a disaster the worst dosa I have ever had... But I will recommend this place for thr sweets which cover up thr all flaws... N the staff is really appreciable so well done n keep it up...  ( Only for the sweets) 👍👍👍👍👌👌👌👌": "9635", "This is one of the oldest sweet shops of this area...  Though not that great but still..... Wellknown Most of he times they wre given the charge to make the prashad in most of the jagaran.. Their chole bhature r really good.... Without onion n garlic..  Rest other items like dosa samosa pakoda etc are ok..... Nothing spl. About them. What i like- dhokla (at reasonable price) as.... though this place is developing... Bt very few places have dhokla. Also their pastries n sweets too are not that bad. Enjoy Happy eating :)": "9635", "Good place. Very good if going out with friends. Food is good, waiting time is bit long but worth your money. Must try Delivery is also good": "18432206", "Nice place Food Quantity is to good Noodal was super Dosa quantity is good but rava coconut dosa it's not good the dosa is undercooked and use coconut powder Usually use fresh graited coconut. Sambhar is too thick and Spicey": "18432206", "Full marks for tasty food, good amount of quantity, fresh food, and cooperative staff. Ample of seating space is available. Providing good competition to nearby restaurants and establishing itself as one of the most popular restaurants in the area.": "18432206", "one of the best bakery for fresh items. you can took anything from here without any hesitation and i am sure you will love it ....  i am loving it .....": "18349914", "Good environment and a postivie attitude towards the staff actually the food was too osum as compared to other at cheapest price i recently visted here yesterday as rated it 5 star good nbc restaurent staff": "18349914", "Their delicious cakes are the reason for my regular visit to this shop and their fast food add a feather in their cap. I suggest all the epicureans to give it a try.": "18349914", "i visited many times to this bakery. this bakery is mainly for pure vegetarian. they gives pure eggless cakes which anyone can eat either in their fast or Navratris.": "18349914", "Perfect ratio of tomatoe sauce and cheese in margherita pizza made by him. Love to had that.Good and enough space for family. Rates and items are good.": "18349914", "Food is ok as per its standard. It is a typical dhaba. But at night, be careful while getting non-veg food packed. Once you reach home, you may find rotten or stale chicken. It's better to have veg food in such dhabas. Not good for family dinner. Please never go there if you have female friends in your group as you may have to deal with staring eyes of bad people. Most of the time female owner sits at the counter but poor lady has little control over hooligans. Not recommended for family dinner....": "9269", "Food is tasty and good. Their serving is good and very attentive. You will find different varieties of shakes, cakes there. I have tried both and was really good. But not that hygenic place.": "18371416", "on my friend's suggestion i decided to order cake for my dad's birthday from bake town.i ordered choco trufle and red velvet cake . I really like the flavor, color, softness and the presentation of this cake. Cake was exactly the same as shown in picture, Cake was very much balanced and it was less sugary and creamy, and i personally thinks, Cake is not just about lots of sugar and cream, it's about experiencing the bliss.": "18371416", "I have ordered two cakes in the past and both were amazing.They customise the cake according to you and they turn out beyond your expectations.From taste to look everything is very amazing.Also the rates are very reasonable": "18371416", "The best bakery in Najafgarh. And the best part is they serve Veg only. Whats better than a delicious cake which is veg too! Bake town serves delicious cakes, snacks, cookies and much more! So, if you are planning to treat your sweet tooth, then this place is👍. Also I liked their Red Velvet pastry a lot❤️❤️": "18371416", "Lovely Pastry tasty, yummy, mouth watering...Very Good Bakery & Prices not expensive... All pastries are my all time favourite.. & Most important all pastries & Cakes are egglesss & Very Soft & Fresh... My Most Favorite Favourite Choco Truffle Pastry & Choco Browine....Yuuuuummmmmmmm.....": "18371416", "Decent place with decent taste and price. Nothing extraordinary but good for the locality. Noodles are of good quality and taste but chicken momos can have a better filling quantity.": "18371421", "Its on the paprawat road in front of the car nikhar/car fashion showrooms....lol... So being a diehard sweets fan.... Went thre one fine day n tried their chocolava cake.... 50rs. N that was yummm..... I was drooling ... Happy that made me... Ah... 😛 😋 😍 That was nice .. .  2nd visit - we were 4, we had  1 grilled sandwich,  2 burgers,  1 pizza n  cold drink...  .  Everything else was average, burgers were better than everything else, sandwich was the normal coleslaw sandwich and he grilled that... ..nothing special..  The pizza was not at all good, actually the boy working there, maybe he didn't know how to prepare a pizza... He took the pizza base, added sauce n toppings (it ws like a sabzi of onion, tomato n capsicum mixed in pizza sauce) and microwaved it for 2 minutes n served... Instead of using the oven mode, me used the microwave mode... And that made the pizza base chewy, it was horrible. So after having a bite or 2 we realised it wasn't prepared properly, n we complained of it.!  The owner ws understanding enough to exclude that from the bill...  . Enjoy all Happy eating.": "312620", "I don't recommend this place for dine in. And this place is just for sometimes when you need very low costing. I recommend to guys who living out..!!!!": "8957", "Nice and good place to regular eating": "8957", "Taste ok ok Not at all hygienic... Yuck... Seating available.... Jst hv d basic snacks ... Nothing more :|                                  ___": "303537", "It's good in budget.. If u will go there so ask for noodles. Noodle is best  dish of them and beside of this chilli patatos are also superb. Try it... It is gud in budget.": "304803", "Hi this too good food and enjoy more with friends and family taste food and enjoy lot prize too good": "9194", "Taste of food was Average ....... food expres special chowmein is good   Malai kofta is worst .........  Amritsari thali is good.......  cleanliness Poor... service poor.....": "18017240", "Tried Amritsari thali which was quite good, naan was properly stuffed, chole were dry but tasty and raita was smooth. Also tried soya malai chaap tikkas which had a taste similar to Afghani chaap.": "18017240", "But it is quite dissappointing that this place is not any more...it had been closed due to huge amount of shop rent.....koi customer hi nhi aata tha kya kar te bichaare😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂.....but the taste was awesome.... Service and staff:4.5/5 Taste:4/5 Dining:4/5": "18464634", "Really poor service. After following up with restaurant i was told my order will be delivered soon. I waited for 1.5 hours and it didnt came i called up and restaurant said they are busy servicing counter customers... finally i cancelled.... please dont order at all.": "311385", "Worst Biriani ever had. It was not even Biriani. Some fried rice with 2 pieces of chicken somewhere. Never go for it. Bekar Bekar  A big no.........": "311385", "I ordered food online which was just one dish and still there was a delay in the delivery.. highly disappointed with the delivery experience..": "311385", "Worst experience  Ordered for food for my guests at 10:50.  Started calling at 11:30 still no response  Finally had to see off the guests with home made food  The guy from Sandoz arrived at 12:05  PATHETIC EXPERIENCE": "311385", "Worst sandoz branch ever......They charge extra for sitting inside the restaurant. Their delivery is never on time. Food quality is not at all good.": "311385", "An affordable outlet and serve wide variety food at affordable price. Taste wasn't that good. I tried their naan with paneer ki subji. If you are short of cash then you can plan to visit this place.": "7416", "The food here is really delicious. Their kadhai chicken is quite amazing, it has got the perfect blend of spices. Breads were also good. One good option, to get your food delivered from in midnight hours.": "18358184", "bad quality food..not worth": "18358184", "no salads and items were changed": "18358184", "taste of dal makhni was average": "18358184", "great food 👍": "18358184", "Love the cutest cupcakes at this place. My friend and I tried it and loved the yummy delicious tastes and flavours. Will be back to try more options.": "9280", "What to have special food to munch in with your sweetheart,then sweetheart cupcakes are the very best option to you.  The cupcakes are so surprisingly amazing with awesome taste.The designs of the cupcakes makes it beautiful and attractive and your jaw drops thinking how that are made?   You just would like to grab the tasty and yummy bite of it.they are colorful,flavorful and moist.The muffins and cakes too are delicious. Best to gift it to your sweetheart.": "9280", "Yummilicious and worth every penny paid!  I wanted to find a cupcake shop to buy/order a box of customized cup cakes for a family party and eventually found this little treasure. Beautiful cakes with fabulously imaginative flavours.  Thanks a ton Ameetha for those lovely cupcakes and for getting it delivered on a short notice . The customized designs were up-to my expectations and loved every bit of it!  I know I'm going to become a regular here!": "9280", "The cupcakes they make are worth every taste bud of yours !!   Taste -  I got three different flavors ( Chocolate, Strawberry and Banana-Cinnamon) and all of them made my day ! Couldn't rank any of them above or below the other.   Design - Very cute and awestruck. All of them were wonderfully crafted to perfection ! The bits of icing they do on their cupcakes are very artistic.   Packaging - Innovative, colorful and Fresh ! They make sure that their packaging get its due attention.   For all those who struggle to get their location, I would recommend that you call them first. They operate on a per-order basis.  Thank you so much for such a sweet delight !!": "9280", "I am not able to get through with the number provided on Zomato.  Can you provide some alternate number so that I can order.  Regards,  Shashwat Srivastava  ,": "9280", "I know it's a bit hypothetical but I would strongly recommend Butter chole than plain chole. Plain chole was not properly boiled. Not much taste. On the contrary Butter chole was too yum to not be ordered again.": "18441658", "Amazing food !!": "18441658", "Chole is not fresh..getting so smell..its not delivered fresh chole ...": "18441658", "Ordered 2 plates of garlic kulchas n 2 plates extra of chole/matar....my usual order..quantity of matar delivered was not the usual...lesser quantity delivered": "18441658", "no taste of mutton Rogan Josh, poor quality food.": "18312652", "Food was pathetic , Worst biryani i ever had with just a small single peace of chiken and was tasteless , Gravey With Naan was very bad in quality and in taste too , all in all a street biryani seller has a good taste than them . Worst Experience": "18312652", "owesome service": "18312652", "Good": "18312652", "food not that good.": "18312652", "This is a super accessible place and best for grab and go. I like their rolls and tikkas. Always up for grabs. Be it breakfast or evening snacks, suits every occasion.  If you wanna know more about delhi food, follow me on insta. My handle is @the.nikita.mehra Or @foodinglyyours. Happy fooding! 😘💓": "308037", "I always go to my nearest green chick chop whenever I want to have some fresh and hygienic chicken I ordered Roasted chicken tikka Mexican chicken ham Both were so juicy and fresh": "308037", "Green chick has been on of my favourite places for a quick bite! Be it their seekh rolls, burgers, pre cooked chicken: i love everything!!! But I had the most horrible experience today. Bought a pack of Peri peri chicken, went home and heated it. It smelled STALE! I took a bite to check(shouldn’t have) and it tasted even worse! It HD such a strong stale taste! I had it throw it! Not to forget my stomach is still so upset 😭😭": "308037", "The outlet provide good quality raw chicken , mutton and fish at very good prices. I usually take raw chicken from here. this outlet also provide quick snacks to enjoyed readily. my favourite is chicken Burger and chicken sandwich the chicken salad was also good in taste and also good health wise.": "308037", "The place has almost every type of meat. Never been disappointed. Must try the masala salami and boneless chicken wings. 👍👍👍👍👍👍 Also, they have delicious sauces which are available at MRP": "308037", "This outlet serves the worst. They serve stale food and it require some serious inspection for quality of stuff they use or else shut down for the sake of their brand name.": "641", "Classic Cold Coffe was just Crushed ice and a complete waste of money.": "641", "Yesterday i visited this pls e friend along... chairs are not good uncomfortable...... Garlic bread was ok Capchino is not capchino flat coffie.. Staff is not good..": "641", "Tried this outlet for very first time and seriously they lack everything. Ordered lemon soda, coffe and garlic bread. The lemon soda was served warm. The breads were tasteless. Not a good outlet to be at": "641", "Yesterday I visited this place along with a friend and ordered Angara tandoori paneer sandwich, crunchy samosa, crispy Kulcha samosa and cafe frappe. The Sandwich was below average and the samosa and Kulcha samosa were decent. Cafe frappe was really awesome to have and made up for rest of the items.": "641", "The name says its all ... Just had chocolate mud mousse that was something i never had before and so in love with it.    Its a must for every chocolate lover .": "307099", "Best chocolates ever!!!!   So I can tell you what the process of having one of the fudgelets for the first time is like and why you DO NOT WANT TO MISS OUT ON SOMETHING LIKE THIS:   1. Admire the packaging but too impatient to open it. 2. The opening of the packaging (like it was any other chocolate) 3. Holding the chocolate in your hand and wondering how good it's going to be. 4. Putting the chocolate in your mouth and just as you start to chew YOU CANNOT BELIEVE THAT CHOCOLATES AS BRILLIANT AS THIS EXISTED.  5. Vow to completely cease the purchase of any other chocolate for there is NO COMPARISON OF ANY CHOCOLATE TO THIS. 6. Decide to tell everyone you know because everyone needs to know that THESE ARE AS GOOD AS CHOCOLATES CAN GET. 7. Open the next wrapper for YOU genuinely CAN'T HAVE JUST ONE!  Go and see for yourself. This is what heaven tastes like. Trust me.": "307099", "The chocolates are superlicious... Gud variety in flavors... A must try Chocolates for all chocolate lovers.... Carry on the good work nd keep on giving us new flavors of chocolates and cakes....": "307099", "good": "307099", "I love your chocolates. My favorite is the chocolate truffle with the liquid filling. Not only me, my family, friends and relatives all loved it. Every time I travel to Delhi, I get demands from my MOM. All the best Chocowell. Keep making great stuff that you do.": "307099", "this place is the solution whenever we don't feel like cooking or when we have unexpected guests. Food served is hygienic and tasty. Prices are reasonable and there is no minimum delivery amount.  What I like: Chur chur naan thali Dal makhni Laccha parantha Chole Kadhi  *No seating available *No Online ordering *It's is Inderpuri, not Naraina": "7419", "Poor food quality, rotis were raw and the dough was of  substandard quality. Food was tasteless all the gravyies were same. In all not worth trying. Poor service.": "7419", "The place serves good, hygenic, food at very nominal rates, usualy it is crowdy at lunch time. It has a small fixed menu and home delivery is good.": "7419", "The only thing I like to have from this place is the dal makhni and lachha parantha because it tastes exactly like my school canteen food.  Everything else is not at all good. The shahi paneer is too watery. Not the most hygeinic place but not that bad either.  You can try if you live nearby. Nothing special.  I just go back for dal makhni and lacha parantha.": "7419", "Nice pocket friendly joint serving good food. The Dal Makhni and the aloo naan here are great. This place serves as a great source for grabbing a quick meal.": "7419", "A pathetic service.. nd also pathetic packaging..also zomato home delivery option also pathetic.. cant manage the staff.. so pathetic.......": "18288199", "The terrace is nice but the food was neither good nor fresh...The staff is polite but food was a major thumbs down...The place had potential.Maybe will improve over time": "18288199", "Food is really amazing  The taste and the quantity Of food is really good. Love the ambience on the roof top  Bravo to the chef and team 👍🏻  Thanks !": "18288199", "Nice food , nice ambience , nice hospitality must go  Value for money , must have mutton roganjosh , all snacks are delicious, best in the winters": "18288199", "Exclellent atmosphere on the roof top top of Picasso with nice food. Served hot and on time. Hotel staff was good and service eas fast enough. I could multiple varieties of veg starters.": "18288199", "This restaurant is located in the middle of a busy Main road The menu offers a wide variety to choose however not everything is good in taste  Fried rice was like I ordered it from a roadside shop however the hot garlic chicken  was too yummy  Also ordered chicken lababdar which tasted nice but the portion was not worth the money": "18435837", "One of my great friend recommended this place but sorry to say this was my worst experience in Naraina Bhatti murg was hard n chewey like leather and the other item that I ordered was disaster because I paid for the Reshmi kebab the kebab pieces was too little n it's full of egg 🍳 foam that the call resham  Thanku never ordering frm this place again Whn i tried 1st time they rejected my orders and this was the 2nd time I placed the order after recommendation but it's a total NO": "18435837", "One of the best food we have tried recently. We ordered chicken and mutton dishes. What can i say the meat just melts in your mouth. Must try for non-vegetarians.": "18435837", "Hmmm this is a place thats located as an isolated grill space on the complete road of industrial area. So the most servings are focused on the take away type of clients and the evening snackers on the way home. The key items that can be the highlight for the place is the bakery products that dey have. A wide range of cakes and pasteries are on the menu. I landed while going home. So a quick bite for a mutton roll and dal makhani and some pasteries were on the platter. To suggest if u wanna grab a quick roll opt for the mutton rather than chicken. As they are limited to seekh rolls. For pasteries dey have daily new itenary for pasteries so suggest to head up nd choose urself. As far as the dal is concerned have a mixed feeling. Since the dal makhani is a common item nd every restaurant has on its menu. Here it was shahi dal makhani. U ll get confused between dal makhani , shahi paneer gravy and butter chicken gravvy. So vegetarians try at ur own risk. For those who like ordering at home they do not serve through zomato but they do through other apps may be some management call.": "18435837", "Hothouse name itself is a complete introduction of this place . Going through the inderpuri todapur road I saw this huge outlet cake factory and hothouse grill. As their menu seems interesting I tried their China garlic chicken tikka and grilled fish in lemon butter sauce . Food deserves a 5* taste. Price is moderate. Their cakes and breads are fresh as I took multi grain and brown bread. Huge space with ample parking.": "18435837", "Osum chicken.. Tandoori chicken was very tasty.. The special earthen Dal makhni is the same like dal bhukara Economical price.. One should try": "18241874", "Please don't go by the previous reviews, I think they are all fake (written by relatives & friends). The dal makhni sucks, it looks like soup and tastes shit. The naans are undercooked. The kadhai paneer tastes only of cream and butter. Afghani chaap was good though.": "18241874", "Really nice food!!! to be honest I wasn't expecting the food to be this gud!!!  hats off to the kitchen staff and the owner for the amazing quality of food.. Prices are good as well!! try the fish Tikka and the cheese Potato.. oh so yummy!!  and Dal with Tandoor ki Roti..  I am still drooling over that food..": "18241874", "Amazing food and great prices. Me, my friends and family have been there several  times now and have always enjoyed the food. Their Dal makhani is out of this world. Being from a punjabi I have had dal at several places but nothing compares to the dal makhani they serve. Food they served is not oily and highly spiced..": "18241874", "We called today at almost 9pm and spoke to the owner Gagan and we were really surprised as he told almost everything is finished and he Recommended Tikka with butter and Their Earthen Dal anyway we have to settle for the same. Food delivery was on time and honestly saying I am glad we called you guys today. Amazing food specially tikka butter was toooo good. Just one word BE IN CHARDIKALA.": "18241874", "When i went naraina visited here....and gets a offer.... The drink is very good in taste": "303250", "Always out of stock. Also, they never answer the call for home delivery at night. What's the point of 24*7 when their services are not available 24*7!": "303250", "It's a 24/7, yet when I called the number 5 times around midnight, no one picked up. What's the point of this shop? Either the number is wrong, which makes their page on zomato useless, or the guy is sleeping in the shop. Very disappointed.": "303250", "It was an emergency visit to this place at 2 in the night. Tried their grilled chicken burger which is amazing. And collected a bag full of chocolates fir the rest of the night.": "303250", "It is the best shop in naraina to get a delicious and tasty paratha like our home having a lot of varieties of parathaand have lot of stuff in it I visited here always once in a week and the staff is very helpful and delivery of food is very fast": "301927", "It was nice experience with this dhaba (paratha hi paratha), valuable price to according to food, and amazing tast by natural dhaba, After all we really enjoyed with dhaba in less amount, Thanks.": "301927", "When you are on a night out, are starving and don't have any jugaad of food, head here for a yummy time!  All kinds of parathas available with butter and achaar at such reasonable rates. I got the gobi and alu-pyaaz paratha packed. Got some butter and pickle to go with it. The size and filling of the paratha is so good that one is enough for one person! Loved both the parathas.": "301927", "This is place which serves 24hrs super awesome parathas. Personally i ate keema paratha at this place with a quater butter and i just loved it. For the best 4 days i continuously ate keeema paratha at this place to get over the craving for the paratha I had while leaving my office.": "301927", "There are times when you are literally craving for something but it is post midnight and you can't find anything. Well, the Parathas from Naraina are God's answer to all the prayers. You get various kinds of Paratha all day long.  Located under the Naraina flyover this place has to be one of the must visit places. Though the concept of 24hour paratha shop is not new (Moolchand) but who cares as far as it is tatsty. Alu-pyaz, paneer and mix parathas are good enough to sooth Vegetarian's taste buds. But the show stopper is the keema paratha. Served with a chunk of butter and curd (you have to pay for it), these parathas would reestablish your whole idea of paratha.": "301927", "There dosa is not that thick and not that tasty .. but ambience is something different .. one of the best thing is the chilled cold drink!! And owner attitude is also not good..": "301931", "Nice place to have a yummy, crispy Dosa! Masala Dosa is delicious with lots of aloo stuffed in it. The coconut chutney is awesome. The Sambhar is hot and delicious. And most importantly, this place is pocket friendly.": "301931", "Nice place for South Indian food in the area. Used to hang out here with friends during school days. Limited seating with just 3 tables but the quality of food is good and worth the money paid": "301931", "in case u are craving a crisp masala dosa  R K dosa is the place- on the inderpuri main mkt road.food is definitely worth a try when u crave south indian. paisa vasool. also nearby are few other good dosa joints. yumyy": "301931", "amazing food....❤️ hot meals on time❤️ I didn't miss my mom's food today ✌️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️": "558", "poor service": "558", "food was delievered almost 30mins late...": "558", "If you love burgers, this is the place for you. Other snacks are great to taste as well. Place better for take away/drive thru as seating is not very spacious. And it may take a while to get a seat in peak hours. But the wait is worth the taste.  Kent is an old outlet, but has become better with time. Must go for snack lovers.": "558", "Nonveg tandoori momos are the best at this place.": "300485", "Great food but quality sometimes reduces(chicken is fresh always, this happens very rarely).But Afgani chicken is really very good. One should definetly try it alteast once.": "300485", "this place serves amazing tandoori momo.they keep liited stock so the window to try this delicacy is 6 to 9 every evening except tuesday .you can also try chicken tikka and seekh kababs.": "300485", "Pahariya meat shop is one hell of a stop to purchase raw meat. it is very clean and of good quality.moreover they also have segregated pieces available like wings,legs,breast etc.": "300485", "Good food in cheap price..": "18312575", "authentic south indian food. masala dosa is value for money": "18312575", "Pathetic Food the butter chicken was really saugy and felt like rubber, the dosa was okay": "18312575", "Malabar poratta is super duper👌👌👌 If yu wish to have a perfect  south indian food ,choice restaurant is the best..!! 💗 Good  service... Well cleaned.. Best tasty dishes apart from the normal north indian foods": "18312575", "Malabar porotta - I don't know why it tasted like a sweet porotta. Thattu dosa - 5 star Chicken roast (semi gravy) - Due to excess tomato paste used in the gravy, it tasted like ketchup. But, a good combination with dosa. Egg curry - Very bad. Do not order. The bowl was half oil, and not a Kerala cuisine dish Kerala meals for 60/- is cheap and tasty. Lot of side dishes, roasted papad instead of fried papad was also good. And Sambar, too was sweetish! Must visit for a mallu. This place will be like a blessed gift in Naraina for a mallu who is font of kerala food.": "18312575", "Was in delhi some reason in 2016  Thought to smoke Hence walked in to the enigma lounge.  Ambience was good Service staff was good  Lightings and cold coffee was average.  Ordered a hookah got on time  I have one suggestion to use desi coal instead of magic coal  Rest all is good": "310666", "This is a really different place which looks more of a wedding destination. The kind of interiors and lights don't go well with it.  Service is really bad.. You've to call them 10 times to change the coal of sheesha.  Music isn't good at all. Food is fine but they should actually work on other things!": "310666", "Lazy staff that lacks professionalism. If you ask for music, they ask to connect your songs (shouldn't be considered as a lounge). Food and ambience overall Doesn't  justify the prices.": "310666", "Very Bad Experience over there. I ordered Vat69 40 ml peg and they served me 8 PM 40 ml peg instead of Vat69 40 ml peg. I dont believe this.": "310666", "went here with a friend a month back, lounge is in the basement and the ambience is quite amusing. ordered chicken momos and spring rolls along with a sheesha but there is no alochol served so thats the only point in which enigma lacks behind. you can play ps3 game in here they have a big screen just chill for some time. i had fun and when the bill came it was reasonable it was a good experience.": "310666", "Yesterday had a craving for Chinese so ordered chilly paneer and paneer fried rice from there. Packing was ok Delivered in time but both were a bit sweeter  Chilly paneer was sweet .paneer chunks were too big and fried .spiciness and use of ginger garlic was missing. Same in fried rice  In chutneys they gave mint chutney and vinegar onion.no ketchup ,no vinegar,no soya  and  no chilly sauce was there. Disappointed with the taste .": "18464625", "Great place to hang out,amazing stuff available. Delicacies out of the world. Great servicing and plethora of dishes to satisfy your taste buds.": "18435330", "I really likhe the food as it was really tasty and hot . The service was good . Really liked this cafe and would surely recommend others....": "18435330", "the food was delicious . I really liked the service and the prices are also not very high and are reasonable. It's a nice place to enjoy with friends.": "18435330", "We have visited chowringhee last night and to our surprise the rolls were awesome. We had a great time and service was also upto the mark. I recommend you to visit and have the best rolls in the city.": "18435330", "It was such a normal place but the food out there was so very gooooooood.. Go try their rolls.. They are amazing... And, they are available at very nominal rates..": "18435330", "This is a good place for Chinese snacks. Their chilly potatoes and pizzas are nice in taste and good in quantity. I tried chilly potatoes, they were spicy but different pieces were sticky which needs to be improved. Overall a good place to have decent food near Aditi college.": "18435326", "The staff is very arrogant, rude.. I must say callaus behaviour to the customers.. Won't buy anything in near future.. and also ency my friends to not to buy from Puri Baker's": "7291", "Puri bakers has been our families favourite for a long time. It earlier only had a branch in model town but now has opened in the pitampura n paschim vihar.. The cakes r flavourful n fresh. Its always packed with customers. Chocolate truffle is our fav..": "7291", "Puri bakers serves best coconut cookies i ever had.. I love coconut cookies n have tried from number of bakeries n they have the best cookies ..apart from coconut cookies pista badam cookies are also recommended. When it comes to cakes they have a good veriety n taste also. If you visit this place eclairs is a must try... I dont like their donuts...they were not fresh and doesnt taste good....": "7291", "lockdown is still on but my favorite garlic bread and pan base pizzas are available on domino's. domino's is heaven.. 😂 garlic bread is Nirvana..": "213", "Ordered farmhouse pizza from this place, the crust was good, but i felt the toppings were less as compared to pizza that i had": "213", "I am really really disappointed with the Dilevery boy named abhishek kumar yadav with having employee id 929333 .. He was worst in having behavioural skills.. He kept my order in the mid of the road by defining there 0 contact dilevery.. Worst experience this time with dominoz.. Not acceptable at all..": "213", "This particular outlet is small and has sitting of almost 20 people only. Usually people take away their orders from here. I love choco lava cake , cheese burst pizza, stuffed garlic bread with jalapeno dip and zingy parcel here.": "213", "I tried thier pepper barbeque chicken pizza . The toppings was good and the base was also soft. Even the size was worth the money": "213", "They have displayed online items which they later tell will not be available once you have paid for it. Very rude staff": "312425", "I have bought bread many times from Oasis but yesterday I have ordered kulcha(bread), and it was not at all fresh. Kulcha's was hard and looked like they were 5-7 days old stock. Due to lockdown I couldn't return it back also, bad experience never again gonna buy from this shop.": "312425", "Zomato is such a shitty app to order anything from any restaurant and in return harming the image of the restaurant because as per them this is the fault from oasis baklawa's end. I as a customer really dont care because niether i am using zomato or oasis baklawa from now on. As a zomato gold member i am really upset with this behaviour from zomato": "312425", "Its located near JwalaHeri market. Best part is this Bakery offers 20% off after 8 pm on Persihable items each day. Their cakes are yummy. I personally love their Choco Truffle Cake and Red Sauce Pasta. Place is spacious, even you can sit inside and eat. They make their own cookies and pack gifts as well in Baskets. They offer A Pastry Combo as well having Mango, Blueberry, Chocolate and Pineapple mini pastries in it. Prices are very nominal.": "312425", "Haldiram for chole bhature. I still wonder how they make so fluffy bhature and best part is they are not even oily. The chole bhature at haldiram is absolute class.": "310281", "I ordered Tandoori platter but had such a bitter experience, I found cockroach in my platter. Upon complaining, the guy was trying to resolve the matter and attempted to remove it from the plate. How disgusting it is, pls do ensure before eating!": "310281", "Brought Gol Gappe with great packing. It was packed like eggs.": "310281", "Nice burger 👌, also have nice seating plan. U will definitely pick your fingers after eating 😉. Definitely I come more than once a week": "9956", "Great food at restaurants prices .really enjoyed": "9956", "Everyone knows about McDonald's so let's talk about ambience, it's great...Service is good as usual and the taste was good too": "9956", "Lovin it !!! Simply because of my all time favourite Macpuff and Mac aloo tikki.Plus best place to hangout with friends.": "9956"}