{"Food was good, they provide quality food but taste of all dishes are allmost same.": "3455", "Corn and peas 👍": "3455", "": "301817", "Whenever I want to eat healthy & diet food, I always prefer going to Subway. They really provide healthy as well as tasty options. This brnach is great location. Very fast service, Decent seating space. Would definitely recommend others.": "3455", "The rolls from. Bon Appétit are simply superb.": "4010", "Bon Appetit has amazing variety of rolls, yesterday for my lunch I ordered chicken roll from this out let. The taste was amazing, stuffing was good, looked so delicious. Must try at least once.": "4010", "Full appetit, bestam best": "4010", "Great place.. This my childhood family restraunt.. Loads of Nostalgia with this place. Great food...": "355", "This restaurant has been around since decades. Best thing about it is that it is vegetarian and food quality is very good. I have been here numerous times and Had decent experience in the past. Overall good": "355", "Early Morning Breakfast...": "355", "requested Indian family half feast which contains 3 sabjis, 5 breads and biriyani with sauce. The feast merited the esteem. Amount was awesome, taste and quality was superior to a dhaba and not exactly a top notch eatery.": "355", "This is a small burger joint in Janakpuri in the close proximity of Maharaja Surajmal Institute. There is no place to sit. Their burgers are very very good, and give tough competition to Dunkin Donuts and others in terms of taste. I tried their Maharaja Chicken Burger and Fish Burger. The burgers are heavy and you will have to force the last few bites down your stomach. Highly recommend this place if you are in West Delhi.   Overall review:  Presentation: 3.5/5 Service: 4/5 Value for money: 4/5 Taste: 4/5": "309283", "Want to have delicious burgers without much hurt on your pocket then do visit Burger Point !! This place serves delicious and yummy burgers. I tried their Veg 'N' Crisp burger, as the name defines the burger was very crispy outside and delicious inside !! Burgers lovers cant miss this place at all": "309283", "This is a very small outlet of Burger point in Janakpuri.  They don't have any sitting and neither do they serve in cars. Its like a take away joint. But the burgers here are as tempting and delicious as at other outlets. Their CHICKEN CHIILY LAVA and DOUBLE CHICKEN AND CRISP burgers are sumptuous! Highly recommended.": "309283", "After fully expanding in Gurgaon, they are now in Delhi. Two outlets in Janakpuri and Vikaspuri each would cater to a big customer base. The best part about Burger Point is it's simplicity, they offer simple burgers, nothing too fancy, add to that a reasonable price. I have seen consistency issues at a couple of occasions from different outlets, thankfully, that didn't happen here. Ordered a Maharaja Chicken Burger and Chicken Cheese Burger and both were awesome. Great Going.": "309283", "Want to grab lip-smacking burgers at a very reasonable price, than Burger point is the place to visit. They serve different variety of veg and non-veg burgers. They also have wraps, shakes and dessert, it's a complete \"Paisa Vasool\" outlet. I tried their Chicken surprise and Aloo tikki cheese burger, both of them were tasty. A must try 👍": "309283", "Pull apart garlic bread- 5/5": "300527", "Shop is quite small with limited sitting area but offers a wide range of food in affordable Price. We have tried Red Sauce Pasta 4/5  Tandoori Pasta 5/5 loved the creaminess and flavors  Alfredo Sauce Pasta- 2/5 not up to the mark, not recommended  Cheese sandwiches 2/5 quite decent in size and were heavy but lacks taste Garlic Bread- 1/5 doesn't taste like garlic bread normal loaf of bread toasted with pizza spices Cold Coffee- 4/5 thick and tasty": "300527", "The food was great and i love it its been like one of my fav eating joints and would love to visit thr always but the place is a bit over crowded which turns it a bit down.": "300527", "The taste Is great...and it's one of my favorite space for pasta and kulchas...for best taste u can rely on it with good QUANTITY and quality...just the area is less..ambience is quite ok...serving is also good": "300527", "I ordered a veg pasta combo. I tasted one of the most flavoured creamy and full of different species in red sauce pasta which has given heavenly taste to it but the garlic bread is somewhat not crispy as it has to be. But the brownie was good as it has a soft base and nuts adding a crunchy flavour to it also sweetness was up to the mark. I enjoyed the overall meal.": "18421049", "awesome food and delivery service": "18421049", "What a terrible experience, the food is disgusting and of terrible quality we ordered dal makni which had water and no visible dals in the container the chicken fingers was pathetic to eat Soo stincky and sour stale as well I need a refund of the amount that I paid u guys can come and take the food away.": "18421049", "Zomato offered me the worst service ever on this order. I have been charged incorrectly and the concern that zomato has shown me after my tries to reach them in return is filthy. I have been charged extra for a pizza that I couldn't even eat because the cheese smelled so bad. I was trying to apply my promo code and for that I was changing my payment method, I was charged for the order before I could apply the discount. I tried reaching zomato and look what I found. Their customer care number says trying another number and hangs up in three tries. Their chat makes you wait for 15 minutes and then hopes that your concern is resolved on it's own. And when you receive a call from delivery, this *** says that do you want the order or not? Doesn't discloses his identity whether he's from zomato or restaurant. And keeps lying. This m an because of who I was charged 40Rs for delivery says that I'm on my way, if you don't want your order I'm going back. I remember you Sunil. And I'll give the entire service a ZERO.": "18421049", "I ordered pasta combo from their outlet which was good and authentic in taste. Specially talking about their food packaging which was superb. Overall nice experience": "18421049", "winter❄⛄ love ❤ and Indian sweet always are always favorite of everyone in every season 😍😚 . Have a look at these 3 different and tasty kind of sweet 😍🙈 first one #gulaabjamun💞 and second is #rasgulla ❤ and last one #malaitost 💖😍 . And gulabjamum and rasgulla my all time favorite😍💕 sweet 💖  #sweettooth #foodie": "300430", "Lot of food options, good sitting space. Pure Veg. Good winter season special menu. However, at times few items from the Menu are not available.": "300430", "A great place to hang out with friends or family. The place has wonderful cuisine and drinks.": "300430", "Discovered a great place for dine outs in janakpuri. The place is really good. This outlet also deals in sweets and street foods like chaat, tikki and all.  So the ambiance at this place is really good and attractive and most of the time you will see families coming to have their meal which means you get a sophisticated crowd here. The place has some decent seating space with some super comfy sofas and chairs.  The service at this place is good but not that great which you expect whenever you visit out for some family time.  Coming onto food we had here:  Starters  ---------  1. Kashmiri seekh kebab  2. Dahi ke sholey   3. Spring rolls  4. Tandoori aloo dilkhush  Starters were good. The best was the crispy and crunchy spring rolls they were really great and worth trying.  Drinks  ---------  1. Virgin mojito   2. Apple virgin mojito  The drinks/moctails are not so great at this place. The drinks we had here were really really sweet. The best among all the drinks is the Apple virgin mojito which really makes it a must try.  Main course  ---------------  1. Dal makhani   2. Paneer khurchan (special)  3. Malai kofta  4. Assorted breads  The food was really great. Main course is something which this is known for so it proved it and justified it's name. Paneer khurchan with butter naan is a must try at this place.  Desserts  -----------   1. Gulab jamun  2. Rasgulla  3. Malai toast  These sweet dishes were really really great and very well satisfied our sweet rush. The best was the malai toast which makes it a must try at bite bikaner.  Overall experience was good. Do visit here for small family parties and get together.  #mustvisit #musttry #bitebikaner #jankapuri #goodfood #malaitoast #paneerkhurchan": "300430", "Had chole bhature which were cost effective and taste was also up to the mark. Huge variety of sweets and cakes also available.": "300430", "Fried momos were dry and hard to chew. Sauce pack wasn't sealed properly so it was all over the place. Not expected from Wow Momos. I have had food from this place before however this time it was just worth it": "18352678", "Sauce was bad. They got a hint of tamarind in their sauce. I mean jaise sauce momos ki sauce hoti h waise bilkul b nahi thi. Regarding momos, they were average. They also don't give Mayo. Just an advise- Don't try Schezwan sauce momos unless you like bittersweet taste.": "18352678", "Hi Everyone, Wow Momo is no doubt the best place to have momos. But in my case i totally drool over their Veggie Momo Burger with a Cheese Slice. I have tried almost whole of their menu but on the top I'll put Momo Burger🤩. It's just wow and a perfect Heavy delight for those who love Spicy Food.": "18352678", "Love the milk cake. Its so tasty and fresh": "18175283", "I visited this place with my family. And we ordered this vegetable pizza, thali and chinese platter..everything was okay in taste with less spices making it eatable for  the ones who like non-spicy food. But the quantity should be given a priority in platters. Rest everything is fine. You can visit this place as a family restaurant 🙂": "18175283", "So some days back I ordered from this place and the food quality was good and taste is very nice and service and packaging is good as usual so basically I ordered the veg tandoori platter in that I got tandoori aloo, veg seekh kabab, paneer tikka, mushroom and I ordered grilled sandwich and rajbhog and rasmalai in desert and it's taste is mind blowing and good 😋": "18175283", "Balushahi quality not fine": "18175283", "Today I visited this place with my friends and we ordered these Punjabi and Chinese and some starters in this I eat chole bhature with onion and chutney then we take paneer tikka with chutney, then we take Manchurian, fried rice, haka noodles and after that we take veg Thali which has shahi paneer, mix veg, daal makhni, rice, dahi pakodi, salad, chutney with papad, mini butter naan and parantha and after that we take chocolate lava with big brownies and cherry it's very tasty and mind-blowing": "18175283", "It was a worst and delayed pizza Pizza is something we order with feelings and if we recieve this  What do you think when you recieve in this condition its was delivered today eve and same time we submit the details with ZOMATO but they have nothing expect an apology note  But shame on this multinational so called domino's  Shame on this kind of service": "8365", "Latest News: Even the pizzas are effected by corona virus. This is how a COVID-19 effected pizza looks like.": "8365", "I love the cheese garlic bread and choco lava cake the most.": "8365", "Serving burnt food and too small portions ..": "8365", "The Night Delights  is My favorite place to order food. They provide delivery on or before time.  Food is also very delicious.  I have tasted Tawa Chicken, Mutton Saag, Afghani Chaap, Paneer Tikka, Mutter Mushrooms, Dal Makhani and enjoyed all of them.  The dishes have a very special aroma and the taste is mouth watering.  Thoroughly enjoyed it........": "18238968", "worst  tawa  roti ever  n   i didn't  get  a butter chiken  ...": "18238968", "average": "18238968", "Thanks to these people for late night deliveries else who would have saved us from midnight hunger... Recently placed an order with them... We ordered Dal Makhni, Malai Kofta, Garlic Naan and Lachha Prantha... The food was very well packed in good containers and delivered in time.The Dal and Malai Kofta were nicely cooked and tasted very well. Also, the breads were soft and nicely prepared.": "18238968", "Wow": "18238968", "Visited with my colleagues. Food was just average.. manager was pankaj over there.. least bothered person.. we ordered soup, butter chicken, malai kofta, dal makhani.. and asked for onion.. and guess what they charged 90 rupees for 2 onions.. Are u people buying onion 1000/kg.. 90-100 rupees doesn't matter for someone who is spending thousands on ur food bill.. its shame for this restaurant and franchise dilli darbar.. its so cheap.. anyways will not suggest anyone to visit this place.. food was also just average..": "2530", "While sitting here we ate a non-veg platter in which the chicken was very old and smelled and the service was so loose that no water was asked.poor expicence all teams waste off money": "2530", "This outlet is very close to my college so i visit this outlet quite often.ambience is very pleasent and soothing.We usually order pasta and chowmein which are my favourite. Food 4/5  Ambience 4/5": "18057812", "Pocket Friendly and decent place to chill. I tired Honey chilli Potatoes. Taste , quantity , quality and service everything was amazing ❗": "18057812", "I’m disappointed with the taste of the food they serve and they took really long to serve as well as the owner was not so attentive in taking our order. It’s a really clean place and is not crowded but food was ok.": "18057812", "This outlet is situated close to our college,and it is one of the places that I visit quite often with my friends.The quality of their food is just amazing specially there egg chowmein that I like the most.": "18057812", "I had manchurian and fried rice. I didn't like them much. Manchurian was raw from inside. Also the services were the worst. They were too engaged in themselves that they forget that they had customers at two table": "18057812", "The singapoori noodles were normal and the thali was good. The food was not hot.The gulab jamun was good in taste.": "357", "Delicious food with comfortable sitting arrangement and service is quite good overall the place is worth it. . #Ambience9/10 #Service9/10 #Taste8/10 #PocketFriendly8/10 . Visit Our Trending Reaction https://hungryreacts.co.in": "357", "Recently ordered from this place, the packaging wss great, I ordered for dal makhni and paneer butter masala along with butter naan , both the curries were good in taste but could have been better, the breads were good.": "357", "Bemisaal is one of the best resturent in Janakpuri. The food here is very delicious, I especially loved the honey chilli chicken,egg fried rice, and mutton rogan josh were amazing too 😁😁😁 Staff was polite and the place was very nice.": "357", "Bemisaal is wonderful restaurant Acast sitting arrangement and peaceful ambience.the soft music and neat and tidy dining gives a very luxury indoor seating.they have a great menu with several different cuisine. It's a perfect restaurant if you are looking for some decent lineout! The food is delicious in paneer butter masala nd stuff parantha nd rahra chicken in every bite. We really loved the service here and had a great experience...": "357", "After shopping, this American veg chop suey came as a  relief. Located in Del15 Food Court at Moments Mall, Kirti Nagar, QDs chop suey was totally relishing. Priced at Rs. 230, the friend noodles along with the sauce was totally a feast.❤️😁": "18277003", "the triple chocolate sundae a must have dessert option at the food court of moments mall. we always binge onto it on our every visit to the mall.": "18277003", "Soup was good but butter chicken was below average.": "18277003", "The noodles had a strange smell coming from them. They felt as if they were infested with insects. The chicken tikka was good, though. QD’s have a reputation. Their branch at Satyaniketan serves decent food. But this branch is horrible. They should be ashamed of themselves.": "18277003", "Reducing the quantity and increasing the price will result in losing old loyal customers. Ordered momos and the quantity is now suddenly reduced to 5 pieces and the price increased. What a way to cheat the customer for own good. That was my last order as there are better value for money places to order from.": "18277003", "Kulhad chai is perfect in every sense.": "18241509", "The quality of tea has detoriated so badly that despite of asking to change. It tasted d same completely water no adrak taste n jus I could feel dey hav boiled it again n given my tea.": "18241509", "Good experience": "18241509", "Subway is one of the meals which proves to be a perfect meal for one person. Love it so much": "8840", "Thanks for accepting the online order and then not delivering it...": "8801", "Really love the chocolate flavoured donuts. Definitely recommend": "305479", "When it comes to donuts I always prefer Dunkin Donuts 🍩. All the flavours are good and yummy but I usually prefer for chocolate one.  #love  #donuts": "305479", "This is a great place for donuts, coffee and other food items. Their coffee is really nice and they have a variety of donuts to choose from.": "305479", "Disgusting. I have ordered food 3 times. Out if which 2 time the order was completely wrong. They didnt even have the descency to call and say they don't the product. They just keep sending the wrong order.": "305479", "Fish was just wow , we had fish tikka so soft and properly cooked ! Butter chicken with garlic naan was a cherry on cake , if spice is your taste do order green chilli paratha . Ambience was little dull but good for family outings . For couples little silent but overall for casual dining’s is good . Do try fish and chicken 🐔": "306245", "Best restuarant in west delhi. awesome ambience with live music {amazing singer} if you r music lover then you should try this place speacially old songs.. and nice sitting arrangements and fingerlicious food they serve i totally loved this place. thanks for the service.": "306245", "This place serves the best Butter Chicken In west Delhi . Hands Down ! 👌": "306245", "I do not know her name but this server(woman) at Domino's punjabi bagh, was very rude.She gave us a medium pizza with 2 oregano & chilli flakes(total)..we asked for more she said it's this much only ...show me !!! Her attitude was rude and careless...she didn't even check the order before handing out !!! Service is pathetic compared to the food": "216", "Nice place with awesome food": "216", "Life saving in quarantine by fulfilling our Pizza cravings. Thanks Dominoes India for serving our pizzas and saving us out from dal roti on regular basis. 😄": "216", "This is my third complaint for Tikka Junction to Zomato. They are unprofessional and donot serve as per the customer requirement. Either food is having too much salt or they do not follow cooking instructions. Speaking to owner has not helped either and staff says to speak to Zomato.i think they would not survive if they do not improve the service. I would urge customers to avoid tikka junction for ordering food .": "308111", "Today i ordered matki chicken,breads,chilli garlic noodles chicken...matki chicken had bloody dry chicken and noodles delivered were veg instead of nonveg and even veg noodles had no veggies there were just noodles..so i called them n they said ok we are delivering new noodles...after 30 min i called again n again n they said it will take more time to deliver n at that moment i said keep ur food n my money with yourself..i will never order again from tikka junction....then after 15 min later delivery guy came n delivred new noodles n then the guy started to argue that they haven't received paytm wallet payment...these are your restaurant standards and i even have payment screenshot, previous noodles photo...shittiest restaurant never going to order again cz this is the 5th time same thing happened to me regarding wrong food item delivery n late delivery...1st pic veg noodles 2nd pic nonveg noodles see the difference urself": "308111", "Ordered two rolls and one curry from tikka Junction. Ordered all these food dishes in non vegetarian. The quantity of food was nice. The place is really hygenic and so we order food from tikka junction only. This is near my area and so it gives us really quick delivery of food.": "308111", "Best place for a typical indian dinner.. love eating frm here everytime i wish to have a good dinner.. chilly chicken to spl gedi chicken i loved it😍😍❤️️❤️️👍🏻👍🏻👍🏻": "308555", "Ordered veg fried rice and aloo paratha ...... very nice food......tried for the first time ..... impressed .........will ordered again. ....": "308555", "Small place that suffers from ventilation issues. Eating there is not a comfortable experience because of all cooking exhaust. Food is also average.": "308555", "Despite providing you a capacious seating area and very well embellished decors, Gedi Grill still manages to deliver a good eating experience. The appetizing food quality can be called as the USP of this place because their service still needs a lot of ameliorations. Located on Najafgarh road close to the Moments Mall, Gedi Grill is a place where the items are slightly overpriced but it is not that big an issue given their likeable taste.   Had gone to Kirti Nagar a few days ago for some and decided to dine here afterwards.  Ordered the following items-  Butter Chicken- The pieces were juicy and the gravy was also adequately spiced.  Chicken Handi- Pieces were a bit chewy but the gravy was fine.  Mutton Rogan Josh- Served in decent portions and tasted good.  That was all that I had at Gedi Grill and as already stated, my dining experience was a good one.  I would certainly provide a few recommendations though-  1). Expansion of the seating area  2). Due attention towards the interiors  3). A little enrichment of food items.  Rest everything seems fine here.  FINAL RATINGS-  FOOD- 3.5/5  SERVICE- 3/5  AMBIENCE AND DECORS- 3/5  VALUE FOR MONEY- 3/5  OVERALL- 3.5/5": "308555", "best place  for family or small party for 20 people. non veg item is too good, also serving in car. best place to dine/drink in car.": "308555", "Waste of tym and money": "308242", "Momos Momos Momos. Always craving for momos. I being a momos lover is very choosy about momos. So i went to little chef few days back. I ordered their chicken afghani momos and chicken kurkure momos. Chicken Afghani Momos: Their chicken afghani momos were veryy soft, very creamy and a bit spicy. The momos were well cooked and presentation was good. Chicken Kurkure Momos: Their chicken kurkure momos were very crispy and spicy. They tasted heaven with that red spicy chutney.": "308242", "Okay okay food. Nothing enticing about it": "308242", "Until you stand on counter they will not prepare your order. However, they ask to wait for 5 mins but eventually forget to prepare.": "8373", "love kfc and everything about it . the buket fried chicken is the best especially wuth the combo meal i like the fries too..................................": "8373", "The place was good, appropriatecare was taken about  hygiene issue. The crowd was also nice, place was well decorated acc to new trends. The food was fresh and tasty. Staff was good at attending customers": "8373", "Best chicken serving chain in India i would say😍 pocket friendly,healthy and tasty what else you want ✌️ don't know how many times i have been there and tried chicken from there can't count literally.": "8373", "Very bad food. Not even worth giving one star. Pasta consisted of only cream and had no taste. Lemonade was just like water. Also, the managers were rude and arrogant. They had no sense of politeness. Won't recommend.": "18294251", "If you are a huge chocolate shake lover... you must go and have yummmmmiiiii kitkat shake here... Super experience... You can just go on and on... Super sexy place to eat your favourite choco glass...you will enjoy this place with best service at your table Zomatoing Zomatoinsta Ipad #dineout ⏺Overall experience :7.9/10 ⏺Sérvice & hygiene :8/10": "18294251", "The burger wasn't the same as shown in the picture. Also, the cheese burst sandwich only had mayo sauce spread and nothing else!": "18294251", "not recommended": "18294251", "nice": "9552", "The pizza was delivered hot and fast but it was undercooked and there was like no cheese on the pizza...it was like eating half cooked pizza with sauce and veggies only...cheese i didn't see any cheese on pizza...my home made pizza tastes much much better...this review is not for dine in its for the delivery": "7396", "Small little place perfect for enjoying pizza. The outlet is located near Kirti Nagar metro station and small area. The staff is great and polite. I ordered veggie loaded my favourite pizza & garlic bread. The taste is amaze 😍.": "7396", "tried there combo which include fried rice/ noddles , spring roll nd chicken gravy ,it was not so good in taste .": "7066", "I wonder how can this place be so highly appreciated by costumers whereas the food served is so awful and horrible! I ordered chicken spring rolls and chicken dimsums , chicken chilii garlic noodles and chilli potato out of which spring rolls were tasty and dimaums were ordinary but the noodle was disasterous and so salty that i threw it away !! Chilli potatoes were bad too and not worth being eaten ! that much of salt and oil is not acceptable in any cuisine! Bad experience!": "7066", "It serves amazing Chinese food tried here combo which includes spring roll ,fried rice and chicken gravy yummy in taste": "7066", "On june 8th 2020 i ordered chicken seekh rolls and half tandoori chicken...both of them were stale n smelling bad....dont eat outside food these corona days..mostly all of the restaurants are selling bad stale quality food": "5663", "Best place to have amritsari fish, they are certainly leaders in this. Though I’m not a fish lover, but still I loved the taste and preparation at this place . Would highly recommend.": "5663", " “What a tasty dal makhni, good and hygenic food prepared in lock down time period , definitely hope to go back.": "476", "Food is good here but the ambience is little boring... Must need something new to bring some more food lovers to this place...": "476", "They do not know how to treat a customer. Good on food, but bad on treatment.": "476", "Not value for money at all. Quantity is very less according to the price that they charge": "306168", "The best Biryani from Bawa’s chicken..   Absolutely Loved it. Gravy served along with it is really scrumptious.. Biryani Lovers.. this is the place for you to have tastiest biryani :) HIGHLY RECOMMENDED!": "306168", "Nice restaurant with very positive environment..... Thats my first visit here.... Had veg platter and bruchette...... The taste was really gud..... Bruchette. Was really gud as compared to other restaurants and the veg platter Dahi and hara bhara Kabab were really gud..... Will visit the place again for some more gud dishes.......": "302715", "I have been to Basil tree with my family on a get together . Trust me , the food is extraordinarily delicious. Either Western or Indian delicacies , everything tasted great . Strongly recommended .": "302715", "We planned the birthday party of our son in the hall behind Basil Tree. We were quite happy with the quality and taste of the food. Hara bhara kebabs, veg pizza and haka noodles were appreciated quite a lot by our guests as well. Overall a very good experience!!": "302715", "Strongly not recommending this place. Located in moments mall, kirti nagar! This place is full of surprises. No, I'm not talking about the good surprises. Let's start from the very basic thing. When I asked them for water, the waiter literally went down the restaurant to buy water bottle. Ignoring it for the first time we ordered food with the worst services provided by any restaurant. And when I asked them for another water bottle, the waiter repeated his moves to bring the water bottle from down the mall. The food was good but accompanied with these kind of services and behaviour of staff, it tastes same as hell. Extremely disappointed with the services!": "302715", "Small decent place,  just next to the food court at Moments Mall. Serves kind of mixed cuisine. Is pretty cramped for space, but the food is actually good. Do try their Dal Makhani, is indeed delicious": "302715", "Karim roll is always our choice over other things in non veg for a little snack to serve. Its filling is amazing which drooles over it. Its best to have and is also affordable. Its taste is little spicy best served with green chutney. The outlet was also well maintained jn the mall and crowd was also good.": "300473", "I want that the restraunt and should work on the price and should reduce it": "300473", "I ordered plain butter naan and butter chicken ... butter chicken was also on the sweeter side and also the naam was a little meetha i dont know why.. average experience.. i was expecting a lot more": "300473", "It is a must for everyone out there to try food out from this place!!! The quality of food is commendable": "300473", "I had ordered mutton Biryani and the service is so fast . I also like the taste of the food it's so tasty. The atmosphere of the restaurant is also good . I would ought to refer this restaurant to my relatives and my friends and i would also like to order once again .": "9050", "There service is mind blowing, I must say❤️ all the snacks i have tried there wass juss amazing 💯💯 but the consequences i faced there was the dj system..": "9050", "Rain Tree Grill was really good with their food. I personally really liked their Dal Makhani & Butter Chicken. In short, they are amazing in their proposition, ie. traditional Indian Food!": "9050", "We had party today and it was very bad experience. Food was tasteless and not even single item liked by all our members. Service was very poor. We came half empty stomach.  Friends don't ever go to this place, you will waste your time and money.": "9050", "Recently visited place for a engagement party ... Nice place for gathering of up to 100 people ... Food was a way too good ... I noticed there was no laeftover food in plates ... Everything was so tasty ... They have valet parking and staff is quite co-operative ... Overall it was a wonderful experience.": "9050", "I was expecting the food here to follow in the old Southern tradition but was pleased to find the menus trending in a contemporary direction with emphasis on lean, fresh and organic fare -- while still keeping with Low Country/Southern convention. My favorite dish at the Ocean Terrace Restaurant, in fact, was shrimp and grits topped with a tasty tasso sauce and loaded with locally netted Georgia white shrimp,which are positively unmatched for flavor. The chef and his staff are staunch advocates of the farm-to-table concept, sourcing produce, meats, poultry and dairy products almost exclusively from Georgia organic farms.": "1904", "Nestled just next to d fab frontier hotel , it's better in terms of service n ambience , wat with newly done interiors n huge space on 1st floor .. But somehow lacks in d taste offered by frontier !!  We tried Puneet butter masala at both places n nothing to beat d rich , masala filled curry of frontier !। Chana masala is good enough . Green chutney is tooo good with heavy amounts of cut onion n mooli . In breads , pyaaz parantha is a must try . It's so good that it can b eaten without any accompanients .. Naan n rotis are big in size n nice ... Boondi raita is great in quantity n taste .. a must have side order .. @500 for 2 people , in d heart of Karol Bagh , a decent fare ...": "1904", "Chole puri are the best in breakfast & chole bhature in the lunch accompanied by lassi 😋... Sweets quality and taste are amazing..": "7526", "Very nice burfee. We ordered in bulk for some family function. Everyone liked it ! The sweetness was apt and the texture was very soft. Overall good experience.": "7526", "One of the best places in Karol Bagh. The place is quite big and serves one of the best coffee and pizza. The staff people are also nice. Hope to visit here again.": "1905", "Raffles is located on the ajmal khan road,the road famous for wedding shopping. And this place is full of options. I have been to this place more than thrice but my recent experience was not quite good. The day was off bt the market was open so we decided to have lunch here. We ordered food and the bill was generated. People working at the restro didn't say a word about the food. We waited for 20 mins but the food didn't come. Soon we realised the chef exiting the kitchen to get food from elsewhere. This is shame for them. After all this the manager still arguing with us of not having the matter and its no big deal for him. Very bad experience. Will never visit this place again.": "1905", "I am a regular customer of this restro because it’s the only proper restaurant in this area per se where you can get variety of food. They serve okay items at reasonable price. I have tried Dal Makhani and Garlic Nan combo here, then there is Vegetable Springrolls which is almost a regular feature in my meals, Crisp chilli potato, Hot Chocolate Fudge, Fruit Salad Sunday, Vada Pav and Fresh Lime Soda. The dishes are fine, nothing special but since they go easy on the pocket, they serve the purpose. The interiors are very basic but again in the given price bracket, they are fine. I always take the seat by the windowside so as to get the view of the busy street of Karol Bagh and the market. Since it located in the heart of the KB market and is quite close to the metro station so after having the supper, it is convenient to shop and catch the Metro back home.  Although there is self-service it doesn’t feel bothersome because Raffels is rarely too crowded, which doesn’t make it awkward to carry the tray to the table. Overall experience of the place is good because this restaurant is pocket friendly and there is variety of food as well.": "1905", "Raffles scores mostly on the ground of its excellent preparations and its interesting ambience. They make you sit on the wrought-iron benches with retro English movie posters all over the place.I relish digging in  ‘Idly Sambhar’, ‘Pasta in red sauce’ , Ice Tea and Iced Hazelnut Cappuccino.": "1905", "Nice ambience and good place to dine at. The cold coffee is awesome and the chinese cuisine very delicious and best place is about self service .": "1905", "I have ordered some food yesterday ,Food delivered y is pethetic and delivery is around 1hr late. Very bad experience. I will never preferred to order again": "18277018", "Excellent food. Absolutely gastronomical the flavours and the cuisines are essentially sorted and beautifully put forward on a warm plate with love. Kudos!": "18277018", "pls don't waste your money here.... when the restaurant is already charging for packing. you should have done it properly. the covering was out..... the food was quite ordinary.... maggi was also not that good they have only added extra salt and green chilli where is the original masala????making it more undesirable to eat......... not very creative... don't get fooled by looking at menu": "18277018", "Overall experience is good.Service is very good.Quality of food is good.We ordered raj kachori and dosa.Pocket friendly restaurant.Visit this place .": "18277018", "tasty and very economical...service is gud but quantity in home service food is not enough ahahha s sjsjjsHysiw ajsuwuwiiwkw uewujwjwjejejwwjwwj ww": "18277018", "The food they give is very tasty. The rolls are super amazing. The taste says a lot about this place.  We ordered-  Chicken Manchurian & chicken chowmin I loved each and everything and very satisfied with their service. Surely recommend it to others.  Taste 4/5": "5560", "I always order tawa chicken n it's always good but this time it was pathetic": "1906", "Pathetic!! Staff can’t pick on time. Unprofessional. There are far Better options out there. Chicken quality is poor and uncooked. Will not order again.": "1906", "boheme cafe and bar is fantastic place for hangout with someone , this place captures the bohemian lifestyle and the electric bar will give you a walk down of venice and prauge , love the ambiance and food was also great and delicious , chilli paneer , drums of heaven was good , and peri peri chicken sauce gives thrill , Afghani chicken jahangiri and fish tikka was fantastic , thanks to vivek for smooth services and staff services are fast , and this outlet is good for the hangout with friends , i would like to recommend this outlet visit  once": "306106", "Tuck inside the alleys of Karol Bagh is this small but cozy restaurant and bar. They have beautiful sitting arrangement and a good North India menu. The main food is not very great but who eats a north indian cuisine with beer. The Pizza I repeat PIZZA Is a must try. People get over with dominoes try this place. The staff is polite and they serve their customer very well. For the Alcohol critics ,the menu isnt very big for you but it enough for you to lighten your mood and chill. This place is a must visit.": "306106", "The place has a soothing and chill ambience. It is a chill place to relax for few hours and the alcohol is budget friendly. But the food is below average. I have chilli paneer, honey chilli potato, pasta, oreo shake and ice tea.. none of it was delicious delicacy. Good for alcohol drinkers, and you can chill and sit for long hours. The staff is slow.": "306106", "Went to this place on weekend and the decor and ambience was welcoming .Ordered some Pizza ,tandoori chicken ,Hot and sour soup and pepper chicken . Absolutely loved the food ! 😁 The only downside was that the size of pizza was way too small in terms of price and as compared to other places but nevertheless they tasted amazing ! Totally recommend this place 👍": "306106", "Nice hidden restobar, good food, decent ambiance, friendly staff. Walkable distance from Karolbagh metro station, good for a couple beer/drink and snacks. We had fish n chips, tandoor assortment both veg and non veg, mutton biryani, all were good.": "306106", "Ample seating area  Great flavours  Hydrabadi biryani is just amazing at this place ❤": "303704", "They have increased prices of kaju paneer like skyrocket earlier it was 180 for half now selling 250 for same, moreover quantity has been reduced along with less kaju and taste.....once it was my fav but now i have same deals in half price in same area...": "303704", "the portion size is so small and the overall filling is too less . sheer waste of money one cant even get a proper mouthfeel of filling . coming to the taste its pretty average .   a big thumbs down 👎": "300594", "Paneer roll and chilli paneer roll. The both panner rolls were amazingly tasty. Chilly panner roll was awsm nd spicy. The Quality of food was impressive. The packing was done good. The delivery was on time.": "300594", "I didn’t expected this, the size of the dish is very small and less. It is thin and small, shawrma is not like this, money waste.": "300594", "Wanna have something tasty and healthy, then this is the best food outlet for you ,  You can find subway outlet almost everywhere in delhi serving  fresh food with freshly baked with variety of sauce .": "306403", "Whenever you feel like eating healthy, choosing subway is the best decision.  I had the roasted chicken sub today. I personally like chicken tikka more than roasted chicken.   The chicken tikka salad is also a must try. Loved it!": "306403", "I ordered roasted chicken sub and chicken tikka salad.I really liked both the the things and they were packed very nicely.I personally prefer chicken tikka sub more but it depends from person to person .Great experience overall!!": "306403", "Subway is a boon. This outlet is good provided you're present right there. What I didn't like was the delivery, I got cold subs thrice. If only they improve on their delivery,it'd be just perfect.": "306403", "Subway is doing great nowadays. Earlier when I used to visit various outlets of subway, the consistency was not there(tastewise) but nowadays, efforts are done to maintain the consistency which I personally love it. I ordered chicken tikka sub &  it turned out to be really awesome.": "306403", "I ordered mini idli 14pcs.  Mini idli (14pcs) - I like the new idea of mini idli. The taste is same as normal idli. I also like mini idli design. 4 🌟/ 5 🌟": "309064", "Service should be better it almost took 30 mins to get a rava masala dosa otherwise according to taste its superb  Value for money  Pocket friendly  Student crowd": "309064", "First of all thank you so much southy there is a very tasty dosa i have ever seen its awesome this is the nearest dosa wala in my home I ordered cheese paneer dosa and ghee roasted dosa from this outlet. The delivery was fast but food was warm and on time, delivery was quick and on time.Packaging was nicely done ..Overall good.": "309064", "I have ordered here paneer dosa, onion dosa, plain dosa, idly... karol bagh.. i love it... But except idly and plain dosa this place is  worth going.... They have the best paneer dosa and onion dosa ...": "309064", "Last to last month when I was in Karol Bagh ...  Me and my friend ... Went to southy Karol Bagh ... Awesome experience...I had dosa and it was so delicious and tried veg rolls delicious it was...and authentic South Indian in taste... were all superb.. Price is reasonable. Staff is humble and courteous.": "309064", "I ordered paneer Tikka masala roll from this place and the roll was not tasty. Though the roll was well stuffed with the filling but the taste was not good. Paneer Tikka was overcooked and the sauces were not balanced in the roll.": "309606", "I was looking for some authentic place to order Chinese food. Post checking the reviews I ordered Honey Chilli Potato. Veg. Hakka Noddles and Chilli Paneer Gravy.  The best thing about Chinese King is that they serve delicious Chinese food at very reasonable prices.  They take care of the packing and quality, which makes the food hygienic.   Recommend Outlet!": "18124379", "Recently I order food from this place. The food is really very tasty. I order their  Veg chowmein  Chilli panner gravy  Egg rice  and Crispy chilli panner.  Delivery is on time.  I received hot food.  Try out place!!!!!!": "18124379", "I ordered veg noodles, the delivery was fast but taste is average only.": "18124379", "Chinese king has really amazing Chinese food with superb quantity and quality. The food items are fresh and yummy at such a reasonable prices. I had chicken masala momos and fried veg momos with hakka noodles. All the food items were mouth watering and delicious. The food received in a proper packaging without any skill and freshly and hot.": "18124379", "I went there with some friends to party. The chinese food was great. The best thing I could find there were the crispy spring roll.I totally love them. I would love to visit this place again in future.": "18124379", "This has been my fav place from last 2 months .....this just great.....awesome food.....staff is ok..........what else should say about this place....140 cant discribe this place": "310758", "Today I ordered hot and sour soup and trust me they put in so many vegetables in the soup that it is seriously so slurping to drink.  The taste of the soup was so refreshing that you would love to drink all over again.  The second thing was the chilly garlic noodles which I thought was a bit dry but the texture of the noodles were really good as it was not very thick and was of good quality  Overall I had a good experience and value for money dinner .  Keep it up!": "310758", "I am very sad to say that if you will visit this restaurant.   You may not take ladies along its not safe coz of the pathetic Nepali staff ! Once I have been there and because of what they did I have also told them who we are so that it will not repeat at least": "310758", "I ordered veg hakka noodles and spring rolls.  The noodles tasted amazing, they had the perfect flavour and were served with delicious veggies including mushrooms, capsicum, carrot, onion and cabbage.  The spring rolls were really heavy. They were served with chopsuey but the outer layer was really thick and oily. Not recommended.  Noodles are a must try.": "310758", "Evening hunger and Chinese cravings- both of them come to an end at this outlet . They serve all Chinese food like momos, chopsuey, noodles, manchurian, fries etc. The food is good and can be tried more than once. Easy in pocket too.": "310758", "I tried their Heart Shaped Famous Aloo tikki , It was soft from inside and crispy outside. The Chutney they serve was unique and tasty .": "312003", "Sindhi Corner is mainly famous for their Sindhi tikki with khati meethi chutney. Their heart shape tikki is definitely crispy and properly cooked and it is so yumm that you will surely at it. They have some other snacks also like pani poori(gol gpappe), dahi balle and gajar ka halva. You can also try their sweet lassi which is also good. Apart from that the tikki is a bit dry from inside, I don’t mean that it should be oily. This tikki is definitely a must try for street food lovers. Thanks.": "312003", "Iam Ordered a Tandoori Paneer Tikka Roll The taste was the roll just ok ok deliver very fast.. if you are very hungry then you love this food other wise not too good food..": "306643", "ordered double egg roll and paneer roll, both were really really good. Have been to this location as well, crowded with people. Rolls were amazing ! Loved them !": "306643", "I ordered single egg and double chicken and i only received normal chicken roll i went to the outlet and he claims it is double chicken and i had an argument with him so we opened the roll and saw it was just single chicken . I asked him to refund the amount he said to talk with zomato. Guys dont fall for this restaurant they are thugs and as it is a takeaway orders they make people fool as they know that they are not gonna come to the outlet and eat the food quietly once they receive at home. Very bad experience zomato should ban such outlets": "306643", "\"The place is great for a south Indian meal and experience.\"Moderate prices...  Decent ambience. Good for family dining. I grew up on their food as we used to frequent here often,but I guess it lost out to competition after so many decades of staying in service": "2407", "The pictures posted are from Balaji Karol Bagh which seems to have closed down. This has no relationship. It is an identity theft.": "2407", "Very poor experience. Order dinner no dinner got delivered from was delivered from the Tomato side and no efforts were taken by the Restaurant side also to get it delivered. Was badly hungry till 11pm.": "2407", "The best South Indian food I've tasted. Good packaging for delivery. Each and every item is packed separately and nicely.  I would suggest everyone must try this Restaurant atleast once.": "2407", "I love going to this place because of its ambience which has so peaceful & vintage vibes !  I love their food as well , I am going there since childhood 🙈  Rates are reasonable too  We had our dinner which included dall makhni , plain tandoori roti , shahi paneer & butter naan !  Service is really appreciable  Staff is too friendly & patient 🙏🏻 They have good quality of South Indian too , MUst try 😋": "2407", "They used to be really good however as all things must come to an end so must this restaurant. The food isn't as great as it used to be, portions are now smaller and not much attending to from the waiters makes them lackadaisical. A once upon a time brilliant restaurant now falling": "1931", "Been to spicy by nature today and it was an amazing experience, the food and service was awesome ambience added flavours to the evening.This is one of the best places that i have been to. Food is very very delicious. This is the best experience that I have ever had. A must visit place. Would recommend this place to everyone ��": "1931", "Awesome value for money place.. must try drum of heaven... Chicken tikka.. chicken chilli.. service also excellent!!!  Must for all who are chicken fans.. fresh chicken served": "1931", "Ordered tandoori chicken and non veg platter from Mr.Grill for a small house party , quality was not upto the standards , chicken pieces were not properly cooked and semi raw close to the bones , afghani chicken marination was not anything great too, chicken seekh kebabs were OK! Not recommended due to the poor quality": "18303704", "Ordered Tandoori Platter. It was not fresh.  Quality - Very bad.  Will never order again.  The whole platter was very bad . Nor fresh neither taste. Wastage of money.": "18303704", "So, I ordered Veg Thali which costs  Rs 100. Fairly cheap ! Ain't it ? The delivery was done in 20 mins or may be soon.  The quantity was good. Fulfilling for even a person with a real good diet.  The food was tasty apart from the roti. They were a bit hard. They had chopped vegetables into raita, the daal was tasty, the rice were fine cooked, shahi paneer was more on a sweeter side, salad was fresh. They even give a papad along.   Taste - 3.5/5  Quantity - 5/5  Delivery time - 20-30 Mins  recommended -4/5": "18303704", "Loved their honey chilli potatoes. Very good service. They made up for the service err happened, and they are fully responsive towards your order. Their honey chilli potatoes, a must try! :) :) Filled with the absolute correct number of spices and veggies.": "18303704", "Ordered a non-veg platter, horrible experience Tandoori chicken(2 pieces): Extremely oily, probably the oiliest tandoori chicken I have ever had  Chicken tikka(4-5 small pieces): A little salty but tasted nice and cooked very well Chicken malai tikka(2 tiny pieces): Barely any meat on the bone, tasted average Chicken Seekh Kebab( 1 seekh cut into 5 pieces): Full of raw onion and were yellow in colour, tasted bad Wouldn't recommend this to anyone. Wouldn't probably order anything from here again. Abysmal packing with malai tikkas dressing and other things' oils flowing into and over each other. Cost: 360 Would have been cheaper to order off of the menu itself. There are much better options around": "18303704", "Decent place to hangout with friends. The Indian non veg tandoori platter was nice. The meat was juicy & succulent. Ordered some breads but were sent back as they were not that crispy as desired, but the chef was helpful to replace the same. Overall go there for music and ambience.": "309998", "Food is good but the ambience sucks.  The staff is busy playing with the sound system . Service is really slow. Ordered Honey Chilli potato which were good. Spring rolls were INEDIBLE. They were burnt.  Would not recommend anyone to visit this place.": "309998", "Amazing day party was amazing amazing In short service bit slow still amazing music 🎂🎂🎂🎂🎂🎂🎂🎂🎂ambience I suggest must visit  Best place in kirti nagar": "309998", "If you ever want to relish best paneer and lachha parantha with green chutney , then Turtle bay in Kirti Nagar is the place to be ... Amazing preparation and tasteful dish ... Yummm": "309998", "Went there for screening of Chelsea V Tottenham. Great place for screenings n all. Great ambience.                               Food was great. :D": "309998", "I frequently order paneer tikka salad from subway but today it was so bad. Veggies were not fresh. I am very much disappointed.": "8840", "Good": "8840", "As usual we were looking for dinner I order a plate containing Dal makhani ,chaap in gravy .,it was good.sitting is not provided ,you can it in open standing watching the road.no proper lightening": "3918", "Taste less, bad service, arogent person sitting at reception counter, over all I will give negative points. To all please never visit this outlet (Near Ramesh Nagar red light).": "3918", "Its a place near metro pillar no 371, at Kirti Nagar. We went there about a month ago, but our experience of their food was really not good as compared to other outlets of wah ji wah. Service was very slow. Food was too spicy to eat. Overall it was a horrible experience.": "3918", "The shittiest place to order your food from. First of all, you have to call them 3 - 4 times to place an order and you're lucky if they pick your call even then. Then, you have to wait for a whopping couple of hours to get your food(shit) delivered. And once you have gone through all of it, well, congratulations, you get the most pathetic food you can ever eat delivered right at your doorstep. The food was that pathetic that I wish there was an option to give negative rating for the shittiest Wah Ji Wah outlet. My personal opinion: BETTER SPEND YOUR MONEY SOMEWHERE ELSE AND NOT REGRET IT LATER.": "3918", "This outlet of wah ji wah is located near raja garden.. Serves a grat variety of chaamp items and a good taste too...  Tawa chaap,afgani chaap roll ,chaap tikka and dal makhni is a must try..  A good place and pocket friendly too.. Like it...": "3918", "Ambience is on average.. Snacks are tasty... But the main course is not up to the marks...... But yes sweet dishes are good... It's just an ok ok place": "306488", "service was good..dz was superb..non-veg varieties were very delicious specially chilly Chiken.....I enjoyed alot there and wanna go again ....": "306488", "A really shady place with disgusting and overpriced food, and very less staff, D'Casa is a place I'd never recommend to anyone. There is always an unpleasant smell coming from the kitchen, the toilet is always unclean and smelly. You'll do nothing but waste your time and money if you visit this place.": "306488", "Pathetic place in kirti nagar. Clay 1 and rain tree is much more better. Service is very slow and staff is not friendly. Ambience us good only, Will no come again in future.": "306488", "Pathetic service by the staff members .  I booked the second floor for a roka ceremony . When i got there to check the arrangements , nothing was prepared . The dishes had rust stains. There was no proper lighting .  A shabby looking dustbin was kept just beside the food counter . Only 2 waiters were present , managing the entire area .  Finally when \"stale\" starters were being served , the manager came in and handed over the bill and asked us to clear the balance or the service will be STOPPED.  What kind of professionalism is this ?  Obviously they were insecure about their service which made them act this way. They feared that we would not pay the entire amount after seeing their horrible service .  I suggest everyone not to book this hall for any of their auspicious days otherwise you yourself will be busy managing the whole event along with the waiters.": "306488", "we went to chocomore in punjabi bagh in delhi. we tried their cupcake which was red velvet. and we also had walnut brownie. the brownie was too good. m always a fan of brownies. this place makes yum customised cakes esp. for wedding or party s ..": "311448", "If you want to have cake and that too very unique, you should head towards here. The quality of cake is really amazing and also the prices are good. You should definitely try it out.": "311448", "I ordered last week one pineapple and one other flavor cake what a taste and so soft   With creamy this creative design and decorated with jam and dry food osm taste and design I suggested to all try it.": "311448", "we get the know abouts this place from a common  friends of our who have been ordering them on regular basis....our experiences  of ordering  from them was ok...": "311448", "The most amazing thing wow momo introduced is there sizzler.The momos and noodles are exactly how I liked it,so damn spicy. Just lovin the taste of it.": "18228870", "This place is best when you want to have momos. They have so much variety of momos and currently I am loving their momos burger. I know some might not like this one, but I really like to enjoy their moburger.😋 Well If you haven’t tried it then you should definitely try this one out.": "18228870", "Amazing veg momos with schezwan sauce Must try place 🥟Sometime all u need is delicious momo🥟 🥟Momo on the move🥟  #momoslove #momoland #delhigram #instagood #wowmomo #foodie #cocacola #eatingforinsta #foodtalkindia #foodblogger #foodphotography📷#instafoodie #foodblogger #delhimomos #delhibloggers #foodie #indianfoodlover #igfoodie #ig #food #loveforfood #Helofoodfever #indianfood #hungernation #kurkuremomos #momoslove #igfood #foodbloggerdelhi #delhiinpictures": "18228870", "#so cheesyday at Chicago pizza ! Had this yummy pizza with capsicum , mushroom , onions , corn as toppings and loads of cheese ! What a taste ! #throwback pic when we had it at Chicago pizza !": "307356", "Me and my brother were not really hungry but we both wanted to have some cheesy dish and so we had ordered one combo of pizza and pasta from Chicago pizza at home and we both had enjoyed having these items.": "307356", "Ordered cheese burst chicken keema 9”inches pizza...was disappointed with the amount of chicken": "307356", "Rates of the dishes from Chicago pizza and the pizza was so yummy and the garlic bread too was yummy. Veggie crust garlic bread and the simply cheese pasta were the best one to try out from Chicago pizza.": "307356", "I ordered 2 pizza from the restaurant. The pizza delivered was half of the order. The delivered pizza was open, cold and the sauce packs touched the pizza. Filthy state of delivery and a non professional attitude. In addition it had no zomato seal. Must never be chosen for delivery by zomato. Poor state": "307356", "Absolutely terrible, there is no nothing else to describe it. I wish I could come up with a word worse than terrible without going obscene. Pathetic": "302142", "Quantity was less with one piece of chicken Tikka and rest is this nonsense. That was also undercooked. I received it after waiting for more than an hour. Pathetic quality and the oil also spilled out of the packaging.": "302142", "Worst experience smell in food nd not properly cooked , my stomach get upset eating dal nd roti very very bad ..don't go to dis place": "302142", "Is this combo or khichdi ... This combo named as 6 pc chicken Tikka and 2 PC kulcha .. But what I got ... See in photo": "302142", "Giani's serves all kinds of ice creams. They have an outlet in the food court in Moments Mall, Kirti Nagar. The counter was hygienic and the staff behavior was good.  I ordered a Red Velvet scoop. The quality of the serving was awesome.  Giani's is a must try for all the ice cream lovers!!": "8845", "Guys this is giaanis and if you didn't know about this Ice cream parlour I am going to tell you that these guys have one of the best ice creams that I have ever heard and the price also reasonable and so far better if you are comparing is this with Baskin Robbins you must try here brownie sundae and hot choco fudge": "8845", "This is my go to place for some amazing desserts. Recently i tried hot chocolate sundae and kulfi faluda and it was absolutely bliss❤️❤️ Its an amazing corner for all the ice cream lovers.❤️": "8845", "I really love the burger they serve especially thr sauce they serve in the burger... This is good place to visit if you are a burger lover": "310253", "i had ordered ice tea and spring roll!! it was of good taste ! my friend told me about this outlet!  packaging was good and food was hot enough to serve at a time! overall i like the service!": "310253", "I ordered chhole bhature from this place and I fell in love with it. The taste was awesome and it was complimented with the pudina chutney.  The food was very hot as their delivery is super fast.": "310253", "it's a outlet located in Kirti nagar inside the food court of moments mall at the Top floor. I was there with one of my friend and I must say they serves really good food. coming to the order we had potato crunch and udta punjab burgers ..both the burgers tasted delicious and also the stuffing inside it was very amazing. and also had their patiala fries which tasted superb too.. it's different from normal fries .Must try!! All over had nice experience with this outlet!!": "18454460", "it was amazing also the Potato crunch it was nice but a basic one.....Overall i really liked this ,in love with their burgers .... delivery was on time and their packaging is simple superb.": "18454460", "Finger licking food, with some really unique flavours for the pallete. It is a success as it gives burgers the unique Indian touch, but at the same time does not lose the essence of a burger. The delivery packaging is really innovative. My favourite option when ordering food at my college.": "18454460", "First of all, if you are interested in having regular American style burgers, this is not the place for you. This is more of your Desi burgers with spices and flavors added accordingly. I love many of their burgers and I have been regular eating at the outlet and also ordering at home. So here is a brief:  1) United States of Punjab burger is the best for me.  2) They have economical burgers as well and they do taste good.  3) I'm not fond of the ice tea we get there.  4) The service is too slow and therefore, I prefer ordering rather visiting the outlet.   5) VFM definitely!": "18454460", "Before talking about the food I would like to give up a Thumbs up for packaging. The burgers are fantastic with the spicy fries and their own brand ice tea. I can promise you that you wont be disappointed.  Recomemended": "18454460", "It's a self service restaurant however order will be served at your table if requested. I ordered chocolate waffle. The waffle was serve at reasonable price. The ambience of restaurant is nice.": "18430600", "Self-service restaurant with good variety of food and awesome taste. Visited here with family. Place is clean and hygienic. Definitely kid-friendly. Ordered Chola Bhatura, Dosa Sambar, Noodles and manchurian, Mini Thali. Except for sambar, everything was good and upto the mark. Prices are economical too.  Food didnt take much time to arrive either. So overall 5/5": "18430600", "I went there with my office colleagues for lunch. Its a self service restaurant. Seating and ambience was fine. We ordered Masala dosa, Paneer dosa, rawa masala dosa, idli sambar vada and Fried rice manchurian. For drinks we ordered Pina colada, Strawberry diaquiri, Sweet Sunrise and Italian Smooch.  South Indian was nice but chinese was really bad. The taste was not good at all.  Mocktails were not at all upto the mark. So better avoid drinking any mocktails here.": "18430600", "This place is amazing and has a alot of variety for every person. From south Indian to chinese, this place has it all that too at it’s best quality and affordable price. Also, loved the ambiance.": "18430600", "Worst experience . I order dal makhni 1 plate from Bangla food by swigy. Quantity is too minimum . at least itna to quantity ho ki 2 logo ko serve ho sake and jab call kiya to kisi Hemant se baat hui and he reply roudly ke aap swigy se baat karo.": "18430600", "I ordered one chicken roll and white Pasta from chinese dragon today 14th AugWhite Pasta is all BITTER ...I guess they use OLD OREGANO which made it worse. I called placed the order via phone so I am not sure whether they will replace my order or not. even the Chicken Roll is Not as it used to be.  The QUALITY OF FOOD IS GETTING WORSE DAY BY DAY. I WOULD NOT RECOMMEND ANYONE THIS FOOD JOINT.": "303635", "The food was so bad that I didn't even care to click a photo. I ordered healthy chowmein which was supposed to serve with broccoli. When I didn't see any pieces of it I went to complaint to the owner who was literally eating chicken from my chicken salad which was my upcoming order. Then the owner guy was casual like nothing happened and started to count the pieces of broccoli in my chowmein. And he was able to count two pieces and gave me excuse that \"nahi hai\" nahi to ladke daal dete.. I was like, you should refuse to serve things that you don't have. Then the chicken salad came again it was suppose to come with broccoli. Totally zhitty experience never waste your money on this cheap jugaad Chinese.  I sent my chicken salad right back at him so he can eat it..": "303635", "Well to start with i had ordered food from here. As usual certainly not from zomato order thanks to dere lousy services. But other app cant name it. Starts with s 😉. So the food when u order is good but make sure you call up and advise them to not to make it spicy. Otherwise you ll only feel spicy hott in ur mouth. Now comes presentation as what i had ordered it was a meal bowl. The packing ws ok being a local food joint the quantity for one fried rice and chicken Manchurian is enough for a meal for one.  Overall there were a lot of veggies it was served hott thanks to the apps delivery guy. But the only flavours i ws left in my mouth was spicy hott thanks to chillies. Even though they had a variety of veggies bt didnt taste anything because of veggies.": "303635", "ordered a combo of chicken fried rice and chilli chicken.  Fried rice had carrots?  And chilli chicken gravy had the consistency of water.  Bad!": "303635", "Tried this place a couple of times for delivery , food quality is bad , taste is average . They think using lots of food color automatically makes the food  amazing so they don't bother putting efforts.": "303635", "I liked the kebabs very much here. The prices were also reasonable and service was also quick. Food is delicious here.": "9552", "Awesome food and great delivery by Zomato. Specially dal makhani and malai chaap (snacks). So creamy and so rich. Always been served fresh and with love💞": "9552", "Bad very bad.": "9552", "I would have given a lower rating if possible. From the staff to the food, everything was utterly pathetic. I should have looked at the reviews before going to this outlet as it does not meet the Yo China standards at all. It'll be better if the management takes some drastic measures to change things around here or rather shut this outlet down if they can't manage it.": "308784", "A really rude staff on the cash counter. Didn't even feel like ordering even though the menu looked tempting. In addition to this, they have a very irrational pricing strategy charging extra for an empty Bowl. Not worth it.": "308784", "not so good in taste .": "308784", "Very cold food": "308784", "I ordered from Yo China today and the food was less than average. I ordered one kung pao chicken, veg fried rice and chicken dimsums. I didn’t like the food at all. Kung Pao Chicken was too sweet, fried rice was normal and dimsums were dry and filled with chillies. I didn’t like the food.": "308784", "ordered crispy chicken wings and chicken white sauce pasta..wings were superb but pasta wasnt upto the mark..The taste was not like an original Alfredo pasta..And they do add many different veggies in it..so vegetable haters do keep this thing in mind.. overall good food in the quoted price ..but the quality can be improved..": "308156", "what a bauchat pizza it was! pathetic, ridiculous,etc etc..I don't have bad word for this pizza!!": "308156", "Pathetic. Never will order again. The buns had fungus on all the 5burgers.": "308156", "BEST IN WEST DELHI": "308156", "Visited this place last may. Just saw the pics on facebook and visited it just because of Island theme. They have good dining area and comfortable seating. Outdoor sitting/ Bar/Dance Floor/Screening is available and its cool outside in summers as well.  We had mocktails and pizza and it was great. Courteous staff, however order got delayed. Good place to visit in West Delhi. Good for office parties with good budget and also family can visit.  Cosmopolition :4.5/5  Please follow our Instagram page @khatti_hatti for more updates 👻": "18378056", "Firangi Island This is the place where you can give your virthday parties to your friends and enjoy their menu😍🔥": "18378056", "When you enter this place the ambience is eye pleasing. The service and food is not good. The staff doesn’t know what to do and how to behave. They keep on telling the food will come it takes almost an hour to bring a dish to the table. The took 1 hour for a sheesha to bring. No dedicated waiter is looking after the table": "18378056", "The staff is so generous and customer friendly!!!So I ordered food from this place and due to some confusion i ordered some fusion dish instead of main course indian dish but my instructions somehow pointed towards main course item. The staff was so generous that they called up to ensure that I get delivered what I actually had in mind!! This Gesture won my heart💕!!And yes the food was fantabulous!!": "18378056", "Aura was superb": "18378056", "Best Place for papri chaat and Pani Puri..Cheap prices": "18337965", "It has been my favourite place for chaat and papdi from a very long time now. Especially their Raj kachori and BTW tikki is incomparable.Good quality food at resonable price.Must visit place guys.": "18337965", "Food is delicious....Good place for kitty parties and small get together.....All things r very good to eat.....But dahi kabab is the yummiest one": "18445784", "Zomato sucks big time called me a liar and denied to provide a replacement or refund  Zomato sucks big time": "18445793", "Today I was there for my lunch and find this restaurant is quite good and serving good pasta. I like their ambiance and sitting plan. Staff was helpful and manager was very good in attending.": "18445793", "Mk chinese food is in dda market keshav puram at lawrence road i took cheese creamy pasta for home delivery it was okay it felt like home made": "18449646", "A handy and feasible place to order some rich festive and delicious cakes for any occas6. Tried the rich pineapple cake and it was very good. Fresh and well packed. Delivery is fast and customization is easy.": "18357561", "The cake delivered to me was good... tasted well and seemed to be fresh not stale..but it was just that it was too sobber....no cake crafting was done as such...but yeah worked well...expecting the restaurant to customize the cake designing feature if possible 😊": "18357561", "In initial I ordered with another bakery pastries its worse than ever. So this I afraid to give order in online for cakes or snacks. But with that confusion only I ordererd one butterscotch pastry last two days before. I didn't expect that much of quality from them. So I was surprised with the fresh cake. It's so yummy my frnds liked it. Thank you.. Will order more from ur store sure 👩‍❤️‍🍰💖 thank you for the fresh lovely cake": "18357561", "Ordered cake a week ago.. delivery guy broke it and delivered to me. Restaurant was informed about the same they offered me replacement but I denied as it was not required. I should have done that I think now. But today the owner or manager contacted me on what's app and very badly tried to insult me asking me to send cake again. It might be zomato must have taken some action against them. Asked me Not to order again. U may guess how dt was....cake was even pathetic....ridiculous people and staff....not even apologetic. Never order from there....worst people and service": "18357561", "Barbeque Nation never leave a checkbox unticked. Perfection and nothing else.  AMBIENCE- Ambience is the only part where this particular NSP branch lacks a bit. But then it's still spread through a good amount of area and has a lot of good vibe to it.   Back to the Business- FOOD!   From the appetizers, chaats, main course and dessert. There wasn't any section which had anything bad in it. I love how the Paneer Tikkas were done. Also, the dessert has many options now for the pure vegetarians as well. Highly recommend! 🔥  SERVICE- The waiters doesn't leave any chance to satisfy any of your requests. Also, the chef himself goes to every table to make sure that everyone likes whatever they're having. Amazing detail to quality. 🔥🔥🔥": "9561", "Experience was so different and superb. Everything was unique and loved it.": "9561", "This barbeque outlet is way different from the one in CP or Rajouri. I felt this place was not upto the high standards set by barbeque nation! The ambience also needs a redo. The food taste was just above average!": "9561", "One of the best places in NSP for a working Lunch/Dinner The alcohol choices are decent while the food is really good. My personal fav though is the Corn as well as the delectable Murgh Tangri": "9561", "Real good place for visiting with family with friends . Has some lip smacking starters in buffet. Price is totally worth it and has wonderful ambiance. Also has a great variety of desserts to satisfy your sweet tooth .": "9561", "Billu's hut is famous for its great taste in reasonable prices but there are some drawbacks. What i had- Mix sauce pasta- 5/5 White sauce pasta- 5/5 Afghani sandwich-2/5 Cheesy veg nachos-3/5 Punjabi tadka pasta- 5/5 Service- 5/5 It's not good for delivery taste totally changes Just have it there I'll suggest 😊 #cheffeine": "2965", "They serves the best pasta in delhi.Varieties of pasta has been served here.Portion of food is good and value for money.If you are in NSP dont miss going here.": "2965", "Loved pasta in every style": "2965", "very nice place for the pasta hangout with your family and friends": "2965", "We organized a get together here..ambiance and drinks was good but the food was not upto the mark but if you are going for dine out the food is good..maybe they weren't able to cater the party well.": "18204820", "I celebrated my bday in Themis barbecue . I enjoyed a lot and the staff was really good nd the food is very delicious .": "18204820", "Visited them last month. On entering, you realise that the indoor seating area is not that spacious. I wanted to be seated outdoors, but then it's only allowed for dinner time. I wasn't very taken by the ambiance.  Coming to the food, I opted for the non-vegetarian buffet option. For drinks, I chose a litchi based mocktail. You could also go for beer or whisky which I think I should have chosen too, now that I think of it. But there's no use crying over spilled milk now. So coming back to my litchi mocktail, let me say it was awesome. Tart and sweet and zingy. Was a pleasant accompaniment to the starters. I really liked the chilly fish, chicken tikka, crispy corn. Cajun potatoes lacked that kick and mutton seekh was really dry. The paneer tikka too wasn't flavourful enough. And the pizza base was very tough.  The main course was so delicious. I am a manchow soup lover. And I helped myself to bowls of the veg manchow soup. Then I came across chicken hot and sour soup and gobbled that up too. I also tried different salads I think you could and should skip them. The chicken biryani and mutton rogan josh warmed up my soul with their distinctly spiced flavours. The biryani deserves special mention with the overwhelming aroma of whole spices and chunky chicken pieces. The rogan josh curry was hot and spicy and I was satisfied then and there. Nevertheless, greed occupied me again while going through other dishes and this time I helped myself to hakka chowmein and stir fried veggies in basil chilly sauce (yeah it's veg. Don't be surprised). The veggie gravy was utterly savoury and had so much going on. Sweet, sour, salty, that fresh basil hit. And by then I realised I was almost full and had to end my main course eating spree.  Coming to desserts, gulab jamuns were soul warming. The chocolate pastry was lush and bitter and kept me wanting more. The tarts were creamy and crumbley. Delicious. Moong dal halwa was all ghee and nuts and heavenly. And the strawberry ice cream was creamy and screamed fresh strawberries and not the artificial colour and flavour stuff.  Overall, it was a decent experience. Although I think cutting out the live music part during afternoons wouldn't be a bad idea afterall. It felt kinda loud and claustrophobic. The service was not bad. The prices were moderate. I paid 1300+ for two non-veg lunch buffets.": "18204820", "Enjoyed a wide range of dishes at this buffet outlet with aesthetic interiors and designer exteriors. Scrumptious barbeque starters with grilled chicken,fish tikka in skewers on the table. Sipped on a variety of mocktails plus the singer was there to entertain throughout our time there. The main course dishes were made very well with excellent sea food, dum biryani , paneer dishes, types of breads and exquisite desserts to choose from namely white chocolate brownie , pineapple pastries , truffle cake and cut fruits. Would definitely recommend to one and all.": "18204820", "Live singing, spectacular ambience and every one enjoying to the grilled kebabs on their table, that's Themis barbeque all about. Based on the concept of buffet where you start with snacks on the table with cool mocktails. I tried the lemon ice tea and charred prawns tikka as well as chicken malai tikka ,their non veg starters were great. Main course I had mutton rogan josh with lachha parantha and enjoyed a few of my favourite desserts namely strawberry tarts and a chocolate truffle cake with cherries. I must say that was a good lunch I relished after long.": "18204820", "One of a friend insisted me to try out this place and yes I had very high expectations out of this place. And I would say I was certainly happy after my meal. The place is quite big with an ample sitting and well designed. Food quality is amazingly good m. Service is also good. Thumbs up to this place .": "307620", "they do not take booking for 2 people and normally say that 2 people can be accomodated at any given point of time... but its all wrong claims.. so a big no for small families.. do not go and waste time unless you have prior booking...": "307620", "Small cockroach on table, Achari Kofta was not at all tangy. Dal was pretty good. Paneer was good and breads too were ok": "307620", "The best burger i ever had among all but the coke was having more ice less coldrink.": "312223", "Place with good crowd and good food . Service is prompt. Find it really inexpensive.  Have a comfortable seating but they don't allow outside food even if you are not consuming it": "312223", "Had burger from Burger King last 3 days, take out as they do deliver to my address. They emailed me a coupon for a free two sauce with my next order. He stated he has never seen burrger king send a coupon delivery only.": "312223", "The ambience was clean and warm. I went their for lunch with my colleagues and they offered  great deal on the food. The staff was polite and the quality of food was also nice. Buffet was available with the snacks and sweets..! Over-all nice experience.": "309542", "Amazing food with good service provide by Mr Hussein. Recommended everyone visit in the Suravie Restaurant...": "309542", "Hussain given by excellent service..": "309542", "Delicious food and great service!": "309542", "Amazing food and excellent service provide by Mr Hussain.Must visit again.....": "309542", "I had had my lunch at this restaurant today and believe me Or not. This is one of the restaurant where you can have food in your budget with good amount of quantity. It's not high end kind of restaurant but having a good mediocre infrastructure. Would be visiting the restaurant soon because it's affordable.": "305086", "superb food": "305086", "Golden tandoor is a nice place for a good family dining 😊 its interior is really appreciable ! We had chicken lababdar along with tandoori rotis ! We had a good time as the food turned out to be delicious ! This place also pays heed to customer satisfaction ! You should definitely try this place for a fine dining ! Happy eating 😊": "305086", "We ordered chicken malai tikka, tawa chicken, naan, roti it was very nice and delicious the presetation was also very nice we enjoyed alot ...": "305086", "Located in the packed area of Rajouri Garden among a myriad of restaurants, Golden Tandoor never fails to satiate our hunger with its delicious food, specially its appetizers, be it vegetarian or non-vegetarian. One of the best places for family dining with reasonable prices.": "305086", "You should increase your food quantity": "978", "Ordered food 2 aloo naan thali Chur chur naan used to be good but quality has decreased Dal was good but it used to be better Quantity and pricing is good Will recommend onion chur chur naan more": "978", "3 Star, Just because this restaurant is not pocket friendly. But food is worth tasting. I have tasted Lachcha Paratha, Shahi Paneer, Dal Makhni.": "978", "Mostly ordered food from here... Love to eat honey chilli potato... Adequate portion...": "2364", "It's a good place to eat some Chinese food I tried their momos and chicken burger both are amazing , I also tried their chicken noddles they were also good. The only thing is there Ambience": "2364", "Raju Chinese food is amazing food joint where I was tried best chicken burger and momos is so good.": "2364", "I have ordered as well as went to this place. This is a small van. The food is quite tasty but when you will look around this place its so pathetic and dirty. Plus the staff also was lethargic. Sometimes they take around 30-35 mins to process an order. I feel the service is great at this place as there are people to take orders and deliver it in your cars. That's a plus point for them.": "2364", "Brady were very crispy as I like. The paneer was good in taste.": "969", "Had a lunch from there and ordered a butter chicken and shahi paneer both of them were great but service was a little slow otherwise loved the food.": "969", "Continues to be amazing": "974", "Awesome restaurant must try fish tikka and their special butter chicken family place and authentic service food is great and service was great": "974", "Same class same taste the best in entire Delhi  I have been visiting them since childhood and till now I have the same taste of food which they made by heart  Keep it up": "974", "So if you are really hungry and want to have non vegetarian food 😍  Then this place will serve you good quality chicken 😍 . . Went to Rajouri garden and tried their food.  Ordered - TANDOORI CHICKEN : it was not properly cooked with tandoor but the taste was spicy and good.  . MALAI TIKKA - must try this dish , chicken was properly cooked with softness and perfect creamy taste. ☺️": "974", "Have been eating from this place for a very long time n yet we are not fed up of the biryani there ....it is very light n tasty .": "305694", "Last night we were planned to take dinner from here... We had chicken biryani first... Biryani was super... Taste was really gud... After that we had tawa chicken tikka and butter chicken with naan... Taste was amazing... Biryani is preferred here... We enjoy our dinner here": "305694", "Punnu biryani is an old outlet but very famous in the West Delhi, heard so much about this outlet that's why ordered from this place like; Soul Fish orlay Chicken chatpataa Tawa Chicken Paranthe  The food experience was excellent as the quality was good. It was packed nicely and delivered properly. Talking about the food, Biryani was too good and the Tawa Chicken was really tasty with paranthas. Highly recommended to all the foodies and non foodies as well.": "305694", "Tried there dark chocolate cake it was very good in taste nd the bread was fresh nd overall it was very good": "4163", "The cake was soft moist and delicious!!! We ordered the cake for our Christmas celebration and it was really fresh and delicious!!!!!!": "4163", "Fraud": "4163", "Nice place for cakes i am always try polka cakes and cookies .people liked this place for cakes it was good experience .good job team keep it up...": "4163", "Ordered a choco chip cake last night and it is sour in taste. Don’t know whether it actually tastes like that or it was not cooked properly. Bad Experience!!!": "4163", "Good food quality": "18241878", "Pathetic taste, it seems they dont how to cook tandori chicken... It seems they have delivered kadhia chicken.": "18241878", "good restaurant at this price . owner was very polite while talking": "301820", "Very unhappy with the food quality and the service. Despite several requests for timely delivery, the food was delivered late. On every call I was given false information and eventually the food was delivered late and the food didn’t taste good too. Hence not a good experience at all!": "301820", "Took more than an hour time to deliver the food": "301820", "I ordered a kadai chicken got butter chicken was so sweet, that it was evident. I ordered afghani chicken and the salt was quite high though i bared it. The biggest blooper was delivery took 1hour and 35 minutes. Placed the order at 9:48pm and got the order at 11:23pm.My hard earned money did not find its worth today.": "301820", "good": "301820", "One can't have worse shahi paneer sabzi. There's NO taste at all, just paneer dipped in some yellow gravy without any salt and spices.": "301817", "The best jalebi in town 😍😍😍😍 So damn amazing 😍 The place to try chur chur naan and jalebi 🥰😋😋😋😋 @fromdifferentkitchens": "301817", "Had some chilli peneer packed from this place and the taste was super delicious and the place is also awesome if you wish to sit and have food at the place": "301817", "There is some issue either from zomato's end of the restaurant's. There is no such place mentioned in the location. Spent an hour looking for it.also the phone number mentioned is also wrong": "18363209", "The cafe has a great ambiance and the chic interiors further accentuate the feel. The food is delicious and you should definitely try the Pastas and Shakes! The quality of service is not the greatest but that should not be a deal breaker. The prices may be a little high for some but the experience is worth it": "18363209", "Good place to hangout with friends and family.  Good ambience good service.   Peri peri paneer pizza and Oreo shake were amazing here ❤ pocket friendly cafe.": "18363209", "This place doesn't even deserve 1.0 rating but that's the lowest Zomato allows us to rate. I visited this place for a quick bite and it turned out to be a mistake. While reading the menu I asked the the person incharge to recommend something  but he remained unanswerable as if it was too difficult for him to suggest something. So I ordered an item which I considered a safe bet - spicy veg burger, a snack which is served good in most of the places. What I received was one burger which not only tastes bad but also is extremely unhealthy as the patty used in burger was made days before, just heated in a microwave and served. On complaining, their response was \"patties are made 3-4 days in advance for the burgers as it consumes time and it would delay our order time\". I have been to various outlets but none of those prepare the patties 3-4 days in advance. And going by the taste, even the roadside burger stalls would serve a better burger at 1/5 of the cost. Not just the food, the attitude of the staff is also disgusting.": "18363209", "Will never recommend this to anyone. No live music.  No live sports screening. Worst food. Attention fresh lime soda lovers, there is a redi wala across the road, uski shikanji best hai @ 1/3rd of the cost here.  P. S. IF U WANT TO GET RID OF YOUR HANGOVER, TRY THE FRESH LIME SODA (SALTY), IT'S EXTRA SALTY 💖💗😍": "18363209", "Splendid food. Pizzas are to die for. Freshness is commendable. Thanks for recommending Saurav Sandhu, we should visit together sometime soon!!": "18472638", "Food here is great you can try anything it taste great the best we found is 5 fruit smoothie a must try.   place is hygiene, cool to sit for small talks.": "18472638", "good food in the most affordable prices....you must try...food is fresh ...go and give yourself a mouth watering treat ..i visit this cafe last week..and is planing to visit it again....": "18472638", "Very nice place in west Delhi to eat good food & make ur health fit & fine  I'm really happy to been dere.  It's really nice ambience wid good music.  Make sure u jus try smoothies & shawrma which is been made by the owner of this cafe it's really awesome.  Guys also the chefs are from U.K. PERFECTIONS. 😀😊": "18472638", "Amazing pizzas and smoothies. Thank you,  {uid:undefined} bhai for the delicious treat :DD when are we going next?????????????????????????????": "18472638"}